//  Code style: предложения и словосочетания в скобочках являются целым словом, они не должны быть длинными, от двух до пяти слов.
//   В запятые не входят пробелы. В интерфейсе и так пространство есть.
//   В определениях для предположений используется "пусть", а в утверждениях "если",
//   поскольку "если", как мне кажется, меньше нагружает текст, чем пусть, но при этом оно
//   не подходит для определений.
//   Математика отделяется в слова по кванторам. Потому вокруг кванторов скобочки.
//   По квантору принадлежности разделения нет. Разделение по кванторам существования и всеобщности
//   Поскольку единицы запоминания в формулировках -- кусочки математики, которые вставляем, по смыслу, как это написать.
//   А в кванторных утверждениях то, как они идут по порядку, потому там делю.
// Корректность определения интеграла для множества бесконечной меры. Могут спросить, когда попросят определение интеграла Лебега.
let analysis_3sem = [
	// Определение интеграла Лебега для ограниченных функций
	[
		"Конечное разбиение измеримого множества",
		["пусть", "мера", "$E$", "конечна", ",",
			"$E$", "$=$", "$\\bigsqcup_{i = 1}^n E_i$", ",",
			"${\\{ E_i \\}}_{i = 1}^n$", "измеримы", ";",
			"${\\{ E_i \\}}_{i = 1}^n$", "называется",
			"конечным", "разбиением", "$E$",
			"(", "т.е.", "произвольное", "множество", "измеримых",
			"подмножеств", ",", "дающее", "при", "дизъюнктном",
			"объединении", "всё", "множество", ")", ",", "множество",
			 "всех", "конечныx", "разбиений", "$E$", "будем",
			 "обозначать", "как", "$P(E)$"
		]
	],

	[
		"Нижняя сумма Дарбу-Лебега для ограниченных функций",
		["пусть", "мера", "$E$", "конечна", ",", "$f$",
			"ограничена", ",", "$E$", "входит", "в", "область",
			"определения", "$f$", ",",
			"$P$", "$=$", "${\\{ E_i \\}}_{i = 1}^n$", "--",
			"конечное", "разбиение", "$E$", ";", "нижней",
			"суммой", "Дарбу-Лебега", "функции", "$f$", "по",
			"разбиению", "$P$", "называется", "$L(P, f)$", "$=$",
			"$\\sum_{i = 1}^n \\inf\\limits_{x \\in E_i} f(x) \\mu(E_i)$",
			"(аналогично нижней сумме Дарбу для интеграла Римана)",
			/*
			"(", "значок", "содержит", "только", "функцию", "и",
			"разбиение", ",", "потому", "что", "множество",
			"однозначно", "определено", "по", "разбиению", ")"
			*/
		]
	],

	[
		"Верхняя сумма Дарбу-Лебега для ограниченных функций",
		["пусть", "мера", "$E$", "конечна", ",", "$f$",
			"ограничена", ",", "$E$", "входит", "в", "область",
			"определения", "$f$", ",", "$P$", "$=$",
			"$\\{ E_i \\}_{i = 1}^n$", "--", "конечное",
			"разбиение", "$E$", ";", "верхней", "суммой",
			"Дарбу-Лебега", "функции", "$f$", "по", "разбиению",
			"$P$", "называется", "$U(P, f)$", "$=$",
			"$\\sum_{i = 1}^n \\sup\\limits_{x \\in E_i} f(x) \\mu(E_i)$",
			"(аналогично верхней сумме Дарбу для интеграла Римана)",
			/*
			"(", "значок", "содержит", "только", "функцию", "и",
			"разбиение", ",", "потому", "что", "множество",
			"однозначно", "определено", "по", "разбиению", ")"
			*/
		]
	],

	[
		"Нижний интеграл Лебега для ограниченных функций",
		["пусть", "мера", "$E$", "конечна", ",", "$f$",
			"ограничена", ",", "$E$", "входит", "в", "область",
			"определения", "$f$", ";", "нижним", "интегралом",
			"Лебега", "$f$", "по", "$E$", "называется",
			"супремум", "нижних", "сумм", "Дарбу-Лебега", "по",
			"всем", "конечным", "разбиениям", ":",
			"$\\underline{I}(f, E)$", "$=$",
			"$\\sup\\limits_{P \\in P(E)} L(P, f)$"
		]
	],

	[
		"Верхний интеграл Лебега для ограниченных функций",
		["пусть", "мера", "$E$", "конечна", ",", "$f$",
			"ограничена", ",", "$E$", "входит", "в", "область",
			"определения", "$f$", ";", "верхним", "интегралом",
			"Лебега", "функции", "$f$", "по", "множеству",
			"$E$", "называется", "инфимум", "верхних", "сумм",
			"Дарбу-Лебега", "по", "всем", "разбиениям", ":",
			"$\\overline{I}(f, E)$", "$=$",
			"$\\inf\\limits_{P \\in P(E)} U(P, f)$"
		]
	],

	[
		"Интегрируемость по Лебегу ограниченной функции",
		["пусть", "мера", "$E$", "конечна", ",", "$f$",
			"ограничена", ",", "$E$", "входит", "в", "область",
			"определения", "$f$", ";", "функция", "$f$",
			"называется", "интегрируемой", "по", "множеству",
			"$E$", "по", "Лебегу", ",", "если", "верхний",
			"и", "нижний", "интегралы", "Лебега", "$f$",
			"по", "$E$", "совпадают"
		]
	],

	[
		"Интеграл Лебега ограниченной функции",
		["пусть", "мера", "$E$", "конечна", ",", "$f$",
			"ограничена", ",", "$E$", "входит", "в", "область",
			"определения", "$f$", ",", "$f$", "интегрируема",
			"по", "$E$", "по", "Лебегу", ";",
			"интегралом", "Лебега", "функции", "$f$", "по",
			"множеству", "$E$", "называется", "общее", "значение",
			"верхнего", "и", "нижнего", "интегралов", "Лебега",
			"$f$", "по", "$E$", "(", "она", "интегрируема", ",",
			"потому", "они", "совпадают", ")"
		]
	],

	[
		"Основная теорема об интеграле Лебега от измеримых ограниченных функций",
		["если", "мера", "$E$", "конечна", ",", "$f$", "измерима", "и", "ограничена",
			"на", "$E$", ",", "тогда", "$f$", "интегрируема", "по", "Лебегу", "на", "$E$", "и",
			"$\\int\\limits_E f(x) d\\mu(x) = \\lim\\limits_{\\Delta(Q) \\to 0} S(Q, f, \\{ t_i \\})$",
			"(интеграл равен пределу интегральных сумм)",
			";", "равенство", "означает", ",", "что", "выполнено", "утверждение",
			"$(\\forall \\varepsilon > 0)$", "$(\\exists \\delta > 0)$",
			"$(\\forall Q, \\Delta(Q) < \\delta)$",
			"$(\\forall \\{ t_i \\}, t_i \\in E_i)$",
			"$\\left| \\int\\limits_E f(x) d\\mu(x) - \\sum\\limits_{i = 1}^n f(t_i) \\mu(E_i) \\right| < \\varepsilon$"
		]
	],

	// Определение интеграла Лебега для неограниченных неотрицательных функций
	[
		"Счетное разбиение измеримого множества для функции",
		["пусть", "мера", "$E$", "конечна", ",",
			"$f: E \\to \\overline{\\mathbb{R}}$",
			"$E_0$", "$=$", "$\\{ x \\in E: f(x) = +\\infty \\}$",
			"$E$", "$=$", "$\\bigsqcup_{i = 0}^\\infty E_i$", ",",
			"${\\{ E_i \\}}_{i = 0}^\\infty$", "измеримы",
			";",
			"счетным", "разбиением", "$E$", "называется",
			"$\\{ E_i \\}_{i = 1}^n$", "(", "т.е.", "произвольное",
			"множество", "измеримых", "подмножеств", ",", "дающее",
			"при", "дизъюнктном", "объединении", "всё", "$E$", ")",
			",", "множество", "всех", "разбиений", "$E$", "будем",
			"обозначать", "как", "$P(E)$"
		]
	],

	[
		"Нижняя сумма Дарбу-Лебега для неограниченных неотрицательных функций",
		["пусть", "мера", "$E$", "конечна", ",", "$f$",
			"ограничена", ",", "$E$", "входит", "в", "область",
			"определения", "$f$", ",",
			"$P = \\{ E_i \\}_{i = 1}^n$", "--", "разбиение $E$",
			";", "нижней", "суммой", "Дарбу-Лебега",
			"функции", "$f$", "по", "разбиению", "$P$",
			"называется", "$L(P, f)$", "$=$",
			"$\\sum_{i = 1}^n \\sup\\limits_{x \\in E_i} f(x) \\mu(E_i)$",
			"(аналогично нижней сумме Дарбу для интеграла Римана)",
			/*
			"(", "значок", "содержит", "только", "функцию", "и",
			"разбиение", ",", "потому", "что", "множество",
			"однозначно", "определено", "по", "разбиению", ")"
			*/
		]
	],

	[
		"Верхняя сумма Дарбу-Лебега для неограниченных неотрицательных функций",
		["пусть", "мера", "$E$", "конечна", ",", "$f$",
			"ограничена", ",", "$E$", "входит", "в", "область",
			"определения", "$f$", ",",
			"$P = \\{ E_i \\}_{i = 1}^n$", "--", "разбиение $E$",
			";", "верхней", "суммой", "Дарбу-Лебега",
			"функции", "$f$", "по", "разбиению", "$P$",
			"называется", "$U(P, f)$", "$=$",
			"$\\sum_{i = 1}^n \\inf\\limits_{x \\in E_i} f(x) \\mu(E_i)$",
			"(аналогично верхней сумме Дарбу для интеграла Римана)",
			/*
			"(", "значок", "содержит", "только", "функцию", "и",
			"разбиение", ",", "потому", "что", "множество",
			"однозначно", "определено", "по", "разбиению", ")"
			*/
		]
	],

	[
		"Нижний интеграл Лебега для неограниченных неотрицательных функций",
		["пусть", "мера", "$E$", "конечна", ",", "$f$",
			"ограничена", ",", "$E$", "входит", "в", "область",
			"определения", "$f$", ";", "нижним", "интегралом",
			"функции", "$f$", "по", "множеству", "$E$",
			"называется", "супремум", "нижних", "сумм",
			"Дарбу-Лебега", "по", "всем", "разбиениям", ":",
			"$\\underline{I}(f, E)$", "$=$",
			"$\\sup\\limits_{P \\in P(E)} L(P, f)$"
		]
	],

	[
		"Верхний интеграл Лебега для неограниченных неотрицательных функций",
		["пусть", "мера", "$E$", "конечна", ",", "$f$",
			"ограничена", ",", "$E$", "входит", "в", "область",
			"определения", "$f$", ";", "верхним", "интегралом",
			"функции", "$f$", "по", "множеству", "$E$",
			"называется", "инфимум", "верхних", "сумм",
			"Дарбу-Лебега", "по", "всем", "разбиениям", ":",
			"$\\overline{I}(f, E)$", "$=$",
			"$\\inf\\limits_{P \\in P(E)} U(P, f)$"
		]
	],

	[
		"Интегрируемость по Лебегу неограниченной неотрицательной функции",
		["пусть", "мера", "$E$", "конечна", ",", "$f$",
			"ограничена", ",", "$E$", "входит", "в", "область",
			"определения", "$f$", ";", "функция", "$f$",
			"называется", "интегрируемой", "по", "Лебегу",
			"по", "множеству", "$E$", ",", "если", "верхний", "и",
			"нижний", "интегралы", "$f$", "по", "множеству",
			"$E$", "совпадают",
			"(всё то же самое, что и для ограниченной функции)"
		]
	],

	[
		"Интеграл Лебега неограниченной неотрицательной функции",
		["пусть", "мера", "$E$", "конечна", ",", "$f$",
			"ограничена", ",", "$E$", "входит", "в", "область",
			"определения", "$f$", ",", "$f$", "интегрируема",
			"по", "Лебегу", "по", "множеству", "$E$", ";",
			"интегралом", "Лебега", "функции", "$f$", "по",
			"множеству", "$E$", "называется", "общее", "значение",
			"верхнего", "и", "нижнего", "интегралов", "Лебега",
			"функции", "$f$", "по", "множеству", "$E$", "(",
			"она", "интегрируема", ",", "потому", "они", "совпадают",
			")"
		]
	],

	[
		"Основная теорема об интеграле Лебега от измеримых неограниченных неотрицательных функций",
		["если", "мера", "$E$", "конечна", ",", "$f$", "измерима", "и", "ограничена",
			"на", "$E$", ",", "тогда", "$f$", "интегрируема", "по", "Лебегу", "на", "$E$", "и",
			"$\\int\\limits_E f(x) d\\mu(x) = \\lim\\limits_{\\Delta(Q) \\to 0} S(Q, f, \\{ t_i \\})$",
			"(интеграл равен пределу интегральных сумм)",
			";", "равенство", "означает", ",", "что", "выполнено", "утверждение",
			"$(\\forall \\varepsilon > 0)$", "$(\\exists \\delta > 0)$",
			"$(\\forall Q, \\Delta(Q) < \\delta)$",
			"$(\\forall \\{ t_i \\}, t_i \\in E_i)$",
			"$\\left| \\int\\limits_E f(x) d\\mu(x) - \\sum\\limits_{i = 1}^n f(t_i) \\mu(E_i) \\right| < \\varepsilon$"
		]
	],

	// Теперь и отныне, мы предполагаем, что функции, когда говорим про интеграл, могут принимать
	//   плюс и минус бесконечности.
	[
		"Линейность интеграла Лебега",
		["если", "мера", "$E$", "конечна", ",", "$f_1$", "и", "$f_2$", "суммируемы", "на",
			"$E$", ",", "$c_1, c_2 \\in \\mathbb{R}$", ",", "тогда",
			"$с_1 f_1 + c_2 f_2$", "тоже", "суммируема", "на", "$E$", "и",
			"$\\int\\limits_E (c_1 f_1(x) + c_2 f_2(x)) d\\mu(x) = c_1 \\int\\limits_E f_1(x) d\\mu(x) + c_2 \\int\\limits_E f_2(x) d\\mu(x)$"
		]
	],
	[
		"Монотонность интеграла Лебега",
		["если", "мера", "$E$", "конечна", ",", "$f_1$", "и", "$f_2$", "суммируемы", "на",
			"$E$", ",", "$(\\forall x \\in E)$", "$f_1(x) \\leqslant f_2(x)$", ",", "тогда",
			"$\\int\\limits_E f_1(x) d\\mu(x) \\leqslant \\int\\limits_E f_2(x) d\\mu(x)$"
		]
	],

	// Экзамен: интеграл Лебега как предел последовательности интегралов от срезок.
	[
		"Срезка",
		["пусть", "$f: B \\to \\mathbb{R}$",
			"(произвольная числовая функция)", ",",
			"$N \\in \\mathbb{N}$", ";", "$N$-ой", "срезкой",
			"$f$", "называется", "функция", "$f_{[N]}: B \\to \\mathbb{R}$",
			",", "$f_{[N]}(x)$", "$=$", "$\\max \\{ f(x), N \\}$",
			"(в каждой точке ограничиваем числом $N$)"
		]
	],
	[
		"Теорема об интеграле неотрицательной функции как пределе интегралов от срезок",
		["если", "мера", "$E$", "конечна", ",", "$f$", "измерима",
			"и", "неотрицательна", "на", "$E$", ",", "тогда",
			"$\\lim\\limits_{N \\to \\infty} \\int_E f_{[N]}(x) d\\mu(x)$",
			"$=$", "$\\int_E f(x) d\\mu(x)$"
		]
	],


	// Сигма-аддитивность интеграла Лебега.
	[
		"Теорема о сигма-аддитивности (полной аддитивности) интеграла Лебега (в курсе часть теоремы о свойствах интеграла)",
		["если", "$E$", "$=$", "$\\bigsqcup_{i = 1}^\\infty E_i$", ",",
			"${\\{ E_i \\}}_{i = 1}^\\infty$", "измеримы",
			"($E$ измеримо как объединение измеримых)", ",",
			"$f: E \\to \\overline{\\mathbb{R}}$", "тогда",
			"$f$", "суммируема", "на", "$E$", "тогда", "и",
			"только", "тогда", ",", "когда", "для", "любого",
			"$k \\in \\mathbb{N}$", "$f$", "суммируема", "на",
			"$E_k$", ",", "и", ",", "если", "$f$", "суммируема",
			"на", "$E$", ",", "$\\int_E f(x) d\\mu(x)$", "$=$",
			"$\\sum_{k = 1}^\\infty \\int_{E_k} f(x) d\\mu(x)$"
		]
	],

	// Абсолютная непрерывность интеграла Лебега.
	[
		"Теорема о абсолютной непрервности интеграла Лебега (в курсе часть теоремы о свойствах интеграла)",
		["если", "$E$", "измеримо", ",", "$f: E \\to \\overline{\\mathbb{R}}$",
			",", "$f$", "суммируема", "на", "$E$", ",", "тогда",
			"$(\\forall \\varepsilon > 0)$", "$(\\exists \\delta > 0)$",
			"$(\\forall e \\subset E: \\mu(e) < \\delta)$",
			"$\\mathopen{}\\left| \\int_e f(x) d\\mu(x) \\right|\\mathclose{} < \\varepsilon$"
		]
	],

	// Я в большинстве теорем пишу измеримо или что-то про меру, это всё по Лебегу.

	// Определение интеграла Лебега для произвольных функций
	/*
	[
		"Интеграл Лебега неотрицательной функции по множеству бесконечной меры",
		["пусть", "$E$", "измеримо", ",", "$\\mu(E) = +\\infty$", ",", "$f: E \\to \\mathbb{R}$",
			";", "$f$", "назывется", "интегрирумой", "по", "Лебегу", "по", "$E$", ",", "если",
			"существует", "последовательность", "${\\{ E_i \\}}_{i = 1}^\\infty$", "такая", ",",
			"что", "$E_i \\subset E_{i + 1}$", ",", "$\\lim E_i = E$", "и", "существует",
			"предел", "$\\lim \\int_{E_i} f(x) d\\mu(x)$"
		]
	],
	*/

	// Лекция 3.
	[
		"Признак суммируемости",
		["Если", "мера", "$E$", "конечна", ",", "$F$", "суммируема", "на", "$E$", ",",
			"$f$", "измерима", "на $E$", ",", "$\\forall x \\in E \ |f(x)| \\leqslant F(x)$",
			",", "то", "суммируема", "на", "$E$", "и",
			"$\\int\\limits_E (c_1 f_1(x) + c_2 f_2(x)) d\\mu(x) = c_1 \\int\\limits_E f_1(x) d\\mu(x) + c_2 \\int\\limits_E f_2(x) d\\mu(x)$"
		]
	],

	// Лекция 4.

	[
		"Теорема Лебега о переходе к пределу в интеграле Лебега",
		["если", "мера", "$E$", "конечна", ",", "$\\{f_n\\}_{n = 1}^\\infty$", "измеримы",
			"на", "$E$", ",", "$\\lim\\limits_{n \\to \\infty} f_n(x) = f(x)$",
			"почти", "всюду", "на", "$E$", "(поточечный предел почти всюду)", ",",
			"$|f_n(x)| \\leqslant F(x)$", "почти", "всюду", "на", "$E$", "для", "любого",
			"$n \\in \\mathbb{N}$", ",", "$F$", "суммируема", "на", "$E$", ",", "тогда",
			"$f$", "суммируема", "на", "$E$", "и",
			"$\\lim\\limits_{n \\to \\infty} \\int\\limits_E f_n(x) d\\mu(x) = \\int\\limits_E f(x) d\\mu(x)$"
		]
	],
	[
		"Теорема Леви о монотонной сходимости",
		["если", "мера", "$E$", "конечна", ",", "$\\{f_n\\}_{n = 1}^\\infty$", "измеримы", "и", "неотрицательны",
			"на", "$E$", ",", "$\\{f_n(x)\\}_{n = 1}^\\infty$", "неубывающая", "почти", "всюду", "на",
			"$E$", ",", "тогда",
			"$\\int\\limits_E \\lim\\limits_{n \\to \\infty} f_n(x) d\\mu(x) = \\lim\\limits_{n \\to \\infty} \\int\\limits_E f_n(x) d\\mu(x)$"
		]
	],
	[
		"Теорема Фату",
		["если", "мера", "$E$", "конечна", ",", "$\\{f_n\\}_{n = 1}^\\infty$", "измеримы",
			"на", "$E$", ",", "$\\lim\\limits_{n \\to \\infty} f_n(x) = f(x)$", "почти",
			"всюду", "на", "$E$", ",", "$f_n(x) \\geqslant 0$", "для", "любого",
			"$n \\in \\mathbb{N}$", "почти", "всюду", "на", "$E$", ",", "тогда",
			"$\\int\\limits_E f(x) d\\mu(x) \\leqslant \\underline{\\lim}\\limits_{n \\to \\infty} \\int\\limits_E f_n(x) d\\mu(x)$"
		]
	],

	// Определение интеграла Лебега для множества бесконечной меры.
	[
		"Корректность определения интеграла Лебега по множеству бесконечной меры",
		["если", "$\\mu(E) = +\\infty$", ",", "$f$", "измерима", "и", "неотрицательна",
			"на", "$E$", ",", "тогда", "для", "любых", "двух", "неубывающих",
			"последовательностей", "множеств", "конечной", "меры",
			"$\\{ E_n \\}_{n = 1}^\\infty$", ",", "$\\{ E_n' \\}_{n = 1}^\\infty$", ",",
			"для", "которых",
			"$\\lim\\limits_{n \\to \\infty} E_n = \\lim\\limits_{n \\to \\infty} E'_n = E$",
			",", "верно", ",", "что",
			"$\\lim\\limits_{n \\to \\infty} \\int\\limits_{E_n} f(x) d\\mu(x) = \\lim\\limits_{n \\to \\infty} \\int\\limits_{E'_n} f(x) d\\mu(x)$"
		]
	],

	// Вспомнить для себя определения понятий предела множества.
	[
		"Корректность определения интеграла Лебега по множеству бесконечной меры",
		["если", "$\\mu(E) = +\\infty$", ",", "$f$", "измерима", "и", "неотрицательна",
			"на", "$E$", ",", "тогда", "для", "любых", "двух", "неубывающих",
			"последовательностей", "множеств", "конечной", "меры",
			"$\\{ E_n \\}_{n = 1}^\\infty$", ",", "$\\{ E_n' \\}_{n = 1}^\\infty$", ",",
			"для", "которых",
			"$\\lim\\limits_{n \\to \\infty} E_n = \\lim\\limits_{n \\to \\infty} E'_n = E$",
			",", "верно", ",", "что",
			"$\\lim\\limits_{n \\to \\infty} \\int\\limits_{E_n} f(x) d\\mu(x) = \\lim\\limits_{n \\to \\infty} \\int\\limits_{E'_n} f(x) d\\mu(x)$"
		]
	],

	// Вычисление меры с помощью кратных интегралов.

	// TODO: math_join([])
	// Комменты потом включить в финальную версию, это просто чтобы мне самому учить, я держу в голове эти вещи)
	
	[
		"Сечение",
		["пусть", "$E \\subset \\mathbb{R}^n$", ",",
			"$E = X \\times Y$",
			"($X \\subset \\mathbb{R}^m$, $X \\subset \\mathbb{R}^k$ и $m + k = n$)",
			";", "сечениями", "$A$", "называются", "множества",
			// "(формально, это отображения из $Y$ в $2^X$ (подмножества $X$) и из $X$ в $2^Y$ (подмножества $Y$)",
			"$A_X(y)$", "$=$", "$\\{ x \\in X : (x, y) \\in A \\}$",
			"(сечение $A$ по $X$ в точке $y$)", ",",
			"$A_Y(x)$", "$=$", "$\\{ y \\in Y : (x, y) \\in A \\}$",
			"(сечение $A$ по $Y$ в точке $x$)"
		]
	],

	// Скобки больше четырёх слов делю на отдельные слова. Сама скобка тогда тоже отдельное слово.
	[
		"Теорема о вычислении меры через меры сечений",
		["если", "$E \\subset \\mathbb{R}^n$", ",", "$E$", "--",
			"измеримо", "по", "Лебегу", ",",
			"$\\mathbb{R}^n = \\mathbb{R}^m \\times \\mathbb{R}^k$",
			"($m + k = n$)", ",", "$X = \\mathbb{R}^m$", ",",
			"$Y = \\mathbb{R}^k$",
			"($X$ и $Y$ -- просто обозначения для удобства)",
			",", "тогда", "верны", "два", "симметричных", "свойства",
			":", "почти", "всюду", "на", "$X$", "по", "мере",
			"$\\mu_X$", "(мера Лебега на $X$)", "$E_Y(x)$",
			"измеримо", "по", "мере", "$\\mu_Y$",
			"(мера Лебега на $Y$)",
			"(т.е. функция $\\mu_Y(E_Y(x))$ определена на $X$)",
			"и", "$\\mu(E)$", "$=$",
			"$\\int_X \\mu_Y(E_Y(x)) d\\mu_X(x)$",
			"(", "интеграл", "Лебега", "для",
			"$\\mathbb{R}^k = X$", ";", "это", "равенство", "значит",
			",", "что", "функция", "измерима", ",", "интегрируема",
			"и", "верно", "это", "равенство", ")", ",",

			"почти", "всюду", "на", "$Y$", "по", "мере", "$\\mu_Y$",
			"$E_X(y)$", "измеримо", "по", "мере", "$\\mu_X$",
			"и", "$\\mu(E)$", "$=$",
			"$\\int_Y \\mu_X(E_X(y)) d\\mu_Y(y)$",
			"(интеграл Лебега для $\\mathbb{R}^m = Y$)"
		]
	],
	// (интегрируема она по основной теореме об интеграле от неотрицательных на множестве бесконечной меры)

	[
		"Определение подграфика",
		["пусть", "$f$", "неотрицательна", "на", "$E$", ";",
			"подграфиком", "$f$", "на", "$E$", "называется", "множество",
			"$D_{f, E} = \\{ (x, y) \\mid x \\in E, y \\in [0, f(x)] \\}$"
		]
	],
	[
		"Лемма о мере подграфика",
		["если", "$E$", "измеримо", ",", "$f$", "измерима", "и", "неотрицательна",
			"на", "$E$", ",", "тогда", "её", "подграфик", "измерим", "на", "$E$", "и",
			"$\\mu\\left(D_{f, E}\\right)$", "$=$", "$\\int_E f(x) d\\mu(x)$",
			"$=$", "$\\int_[0, +\\infty] \\mu_X(\\{ x \\mid f(x) \\geqslant y \\}) d\\mu_Y(y)$"
		]
	],

	[
		"Теорема Фубини",
		["если", "$E$", "измеримо", "по", "Лебегу", ",", "$f: E \\to \\overline{R}$",
			"суммируема", "на", "$E$", ",", "$E$", "$=$", "$X \\times Y$", ",", "тогда",
			"$g_x(y) = f(x, y)$", "суммируема", "на", "$Y$", "почти", "всюду", "на",
			"$X$", ",", "$I(x)$", "$=$", "$\\int_Y f(x, y) d\\mu(y)$", "суммируема",
			"на", "$X$", ",", "$\\int_E f(v) d\\mu(v)$", "$=$",
			"$\\int_X I(x) d\\mu(x)$", "$=$",
			"$\\int_X \\int_Y f(x, y) d\\mu(y) d\\mu(x)$"
		],
		[], // Подсказки к доказательству.
		[""] // Комментарии, без составления, просто прочитать, если хочется лучше понять.
	],

	[
		"Область (напоминание)",
		["пусть", "$U \\subset \\mathbb{R}^n$", ";", "$U$", "называется", "областью", "в $\\mathbb{R}^n$", ",",
			"если", "оно", "открыто", "и", "линейносвязно",
			"(т.е. любые две точки можно соединить непрерывной кривой)"
		]
	],

	[
		"Диффеоморфизм (переопределение, более общее определение, чем в прошлом семестре)",
		["если", "$U$", "--", "область", "в", "$\\mathbb{R}^m$", ",", "$V$", "--", "область", "в", "$\\mathbb{R}^n$",
			",", "$\\varphi: U \\to V$", ";", "$\\varphi$", "называется", "диффеоморфизмом", ",", "если",
			"$\\varphi$", "биективно", ",", "непрерывно", "дифференцируемо", "(", "дифференцируемо", "и",
			"частные", "производные", "непрерывны", ")", ",", "матрица", "Якоби", "имеет",
			"максимальный", "возможный", "ранг", "($\\min \\{ m, n \\}$)"
		]
	],

	// Замена переменных в одномерном интеграле Лебега
	[
		"Теорема о замене переменных в одномерном интеграле Лебега",
		["если", "$\\varphi: U \\to V$", "--", "диффеоморфизм", "$U$", ",", "$V$",
			"--", "интервалы", "$\\mathbb{R}", "(интервал измерим)", ",", "$f$",
			"суммируема", "на", "$V$", "$f: V \\to \\overline{\\mathbb{R}}$", ",",
			"$f$", "суммируема", "на", "$V$", ",", "тогда",
			"$\\int_V f(v) d\\mu(v)$", "$=$",
			"$\\int_U f(\\varphi(u)) |\\varphi'(u)| d\\mu(u)$"
		]
	],

	// Теорема о разложении
	[
		"Простой диффеоморфизм",
		["пусть", "$U_0$", "--", "окрестность", "нуля", ",", "$g: U_0 \\to \\mathbb{R}^n$", ",",
			"$g$", "--","диффеоморфизм", ";", "$g$", "называется", "простым",
			"диффеоморфизмом", ",", "если", "$(\\exists j)$", "$(\\forall i: i \\neq j)$",
			"$(g_i(x) = x_i)$", "(меняет только одну координату)"
		]
	],
	[
		"Теорема о разложении",
		["если", "$U$", "--", "окрестность", "нуля", ",",
			"$\\varphi: U \\to \\mathbb{R}^n$", "--",
			"диффеоморфизм", ",", "тогда", "существует",
			"окрестность", "нуля", "$V$", "такая", ",",
			"что", "$V \\subset U$", "и", "$\\varphi$", "на", "$V$",
			"представимо", "в", "виде",
			"$g_n \\circle B_n \\circle \\ldots \\circle g_1 \\circle B_1$",
			",", "где", "$\\{ g_i \\}_{i = 1}^n$", "--", "простые", "отображения",
			",", "$B_i$", "--", "отображения", ",", "переставляющие", "пару",
			"координат", "(", "возможно", ",", "одну", "и", "ту", "же", ",", "т.е.",
			"тождественные", ")"
		]
	],

	// Теорема о замене переменных в кратном интеграле Лебега одна и та же, просто лектор
	//   разбил доказательство на два пункта и сделал это двумя пунктами.
	//   Если я рассказываю формулировку, мне не страшно.
	[
		"Теорема о замене переменных в кратном интеграле Лебега (по Вадиму Витальевичу Редкозубову)",
		["если", "$\\varphi: U \\to V$", "--", "диффеоморфизм", ",", "$E$", "измеримо", "по", "Лебегу", ",",
			"$f$", "измерима", "по", "Лебегу", "и", "неотрицательна", "на", "$E$", ",", "тогда",
			"$\\int_V f(v) d\\mu(v)$", "$=$",
			"$\\int_U f(\\varphi(u)) |\\mathopen{}\\operatorname{det}(\\varphi'(u))\\mathclose{}| d\\mu(u)$",
			"($\\varphi'$ -- сильная производная, якобиан)"
		]
	],

	[
		"Критерий Лебега интегрируемости по Риману",
		["если", "$f$", "ограничена", ",", "$[a, b]$", "входит", "в", "область", "определения",
			"$f$", ",", "тогда", "$f$", "интегрируема", "по", "Риману", "на", "$[a, b]$",
			"тогда", "и", "только", "тогда", ",", "когда", "она", "непрерывна", "почти",
			"всюду", "на", "$[a, b]$"
		]
	],

	// Лемма Витали.
	[
		"Покрытие промежутками в смысле Витали",
		["пусть", "$E \\subset \\mathbb{R}$", ",", "$\\tau$", "--", "множество", "промежутков", "(отрезков, интервалов, полуинтервалов)", ";",
			"$\\tau$", "называется", "покрытием", "$Е$", "в", "смысле", "Витали", ",", "если", "$(\\forall x \\in E)$", "$(\\forall \\varepsilon > 0)$",
			"$(\\exists I \\in \\tau: |I| < \\varepsilon)$", "$x \\in I$", "(", "т.е.", "для", "любого", "$x$", "найдется", "сколь",
			"угодно", "малый", "промежуток", ",", "который", "его", "содержит", ")"
		]
	],
	[
		"Лемма Витали",
		["если", "$\\tau$", "--", "покрытие", "$E$", "в", "смысле", "Витали", ",", "внешняя", "мера", "$E$", "конечна",
			",", "тогда", "$(\\forall \\varepsilon > 0)$", "$(\\exists \\{ I_1, \\ldots, I_N\\} \\subset \\tau)$",
			"$\\mu^*\\mathopen{}\\left(E \\setminus \\bigsqcup_{i = 1}^N I_i\\right)\\mathclose{} < \\varepsilon$"
		]
	],
	
	// Суммируемость производной монотонной функции.
	[
		"Теорема о суммируемости производной монотонной функции",
		["если", "$f$", "неубывает", "на", "$[a, b]$", ",", "тогда",
			"$f$", "дифференцируема", "почти", "всюду", "на",
			"$[a, b]$", ",", "$f'$", "суммируема", "на", "$[a, b]$",
			",", "$\\int_{[a, b]} f'(x) d\\mu(x)$", "$\\leqslant$",
			"$f(b) - f(a)$"
		]
	],

	// Чтобы использовать теорему, мы должны выполнить всё её предположения,
	//   а для этого нужно, чтобы объекты, которые мы найдем, удовлетворяли
	//   определениям. Чтобы объект удовлетворял определению, нам нужно,
	//   чтобы объект подходил под предположения, иначе не определено, и были
	//   выполнены условия.

	// Производная неопределённого интеграла Лебега.
	[
		"Теорема о производной неопределённого интеграла Лебега",
		["если", "$F$", "--", "неопределённый", "интеграл", "$f$",
			"на", "$[a, b]$", ",", "тогда", "$F$",
			"дифференцируемо", "почти", "всюду", "на", "$[a, b]$",
			"и", "$F'(x)$", "$=$", "$f(x)$", "почти", "всюду",
			"на", "$[a, b]$"
		]
	],

	// Абсолютная непрерывность и неопределённый интеграл Лебега.
	[
		"Теорема об эквивалентности абсолютной непрерывности и неопределённого интеграла Лебега",
		["если", "$A$", "--", "отрезок", "$\\mathbb{R}$", ",", "$F: [a, b] \\to \\mathbb{R}$",
			",", "тогда", "$F$", "неопределённый", "интеграл", "Лебега", "по", "$[a, b]$",
			"некоторой", "функции", "тогда", "и", "только", "тогда", ",", "когда", "$F$",
			"абсолютно", "непрерывна", "на", "$[a, b]$"
		]
	],

	// Лекция 9.

	[
		"Полилинейная форма",
		["пусть", "$E = \\mathbb{R}^n$", ",", "$E^*$", "--", "сопряженное", "пространство",
			"к", "$E$",
			"(т.е. пространство линейных функционалов, форм, т.е. линейных отображений из $E$ в $\\mathbb{R}$)",
			",", "$U: E^p \\times {\\left( E^* \\right)}^q \\to \\mathbb{R}$", ";",
			"$U$", "называется", "полилинейной", "формой", "на", "$E$", "валентности", "$(p, q)$",
			"($p \\geqslant 0$, $q \\geqslant 0$, могут быть равны нулю; если $q$ равно нулю, $U$ просто функция на векторах)",
			"(в дальнейшем будем называть просто $(p, q)$-формой)", ",", "если", "линейно", "по",
			"каждому", "из", "своих", "аргументов",
			"(например, по первому, т.е. для любых $\\alpha, \\beta \\in \\mathbb{R}$ $U\\mathopen{}\\left(\\alpha x_1' + \\beta x_2'', x_2, \\ldots, x_p; y^1, \\ldots, y^q\\right)\\mathclose{} = \\alpha U\\mathopen{}\\left(x_1', x_2, \\ldots, x_p; y^1, \\ldots, y^q\\right)\\mathclose{} + \\beta U\\mathopen{}\\left(x_1'', x_2, \\ldots, x_p; y^1, \\ldots, y^q\\right)\\mathclose{}$)"
		]
	],

	[
		"Соответствие полилинейной формы значениям на базисных элементах",
		["если", "$U$", "--", "полилинейная", "форма", "на", "$E$", "валентности", "$(p, q)$",
			"$e_1, \\ldots, e_n$", "--", "базис", "$E$", ",", "$e^1, \\ldots, e^n$",
			"--", "двойственный", "базис", "к", "$e_1, \\ldots, e_n$",
			"($e^j(e_i) = \\delta_{ij}$ -- символ Кронекера, равный $1$, если $i = j$, и $0$ иначе)",
			",", "тогда", "$U$", "однозначно", "определяется", "своими", "значениями", "на",
			"базисных", "элементах", ",", "т.е.", "числами",
			"$w_{i_1 \\ldots i_p}^{j_1 \\ldots j_q} = U\\mathopen{}\\left(e_{i_1}, \\ldots, e_{i_p}; e^{j_1}, \\ldots, e^{j_q}\\right)\\mathclose{}$",
			",", "$(i_1, \\ldots, i_p) \\in {\\{1, \\ldots, n \\}}^p$", ",",
			"$(j_1, \\ldots, j_q) \\in {\\{1, \\ldots, n\\}}^q$"
		]
	],

	// Чтобы привыкнуть писать не в теоремах, а в вычислениях, и немного поработать с ними.
	[
		"Разминка на полилинейные формы",
		["возьмём", "$E = \\mathbb{R}^2$", ",",
			"базис", "$e_1 = (1, 0)$", ",", "$e_2 = (0, 1)$", ",", "двойственный", "базис",
			"$e^1(v) = v_1$", ",", "$e^2(v) = v_2$", ";", "для",
			"$U: E \\times {\\left( E^* \\right)} \\to \\mathbb{R}$", ",",
			"$U\\mathopen{}\\left(x_1; x^1\\right)\\mathclose{} = x^1(x_1)$", "координаты",
			"в", "базисах $e_i$", ",", "$e^i$", "получатся", "такие", ":",
			"$w_{1,1} = U\\mathopen{}\\left(e_1; e^1\\right)\\mathclose{} = 1$", ",",
			"$w_{1,2} = U\\mathopen{}\\left(e_1; e^2\\right)\\mathclose{} = 0$", ",",
			"$w_{2,1} = U\\mathopen{}\\left(e_2; e^1\\right)\\mathclose{} = 0$", ",",
			"$w_{2,2} = U\\mathopen{}\\left(e_2; e^2\\right)\\mathclose{} = 1$"
		]
	],

	[
		"Тензор",
		["пусть", "$U$", "--", "полилинейная", "форма", "$e_1, \\ldots, e_n$", "--", "базис", "$E$", ";",
			"тензором", "полилинейной", "формы", "$U$", "в", "базисе", "$e$", "называется",
			"набор", "чисел", "$w_{\\vec{i}}^{\\vec{j}}$", "по", "всем",
			"$\\vec{i} \\in {\\{1, \\ldots, n\\}}^p$", "$\\vec{j} \\in {\\{1, \\ldots, n\\}}^p$", "из",
			"утверждения", "о", "соответствии", "полилинейной", "формы", "значениям", "на", "базисных", "элементах",
			"(т.е. это координаты полилинейной формы в некотором базисе)", ";", "валентностью", "тензора",
			"называется", "валентность", "соответствующей", "полилинейной", "формы",
			"(пара чисел $(p, q)$; посчитать можно как количество индексов у тензора снизу и сверху)"
		]
	],

	// Полилинейные формы образуют линейное пространство.
	// Базис в пространстве полилинейных форм.
	// Тензорное произведение.
	// Свойства тензорного произведения.
	// Представление базисных форм.
	// Переход к другому базису.
	// Преобразование тензоров при замене базиса.
	// Набор чисел, задающий тензор.
	// 

	// Не пишу, что E = \\mathbb{R}^n, т.к. полилинейные формы у нас определены только для \\mathbb{R}^n, а степень \\mathbb{R} здесь не важна.

	[
		"Пространства полилинейных форм",
		["пусть", "$E = \\mathbb{R}^n$", ";",
			"множество", "всех", "полилинейных", "форм", "на", "$E$", "валентности",
			"$(p, q)$", "называется", "пространством", "$\\Omega_p^q(E)$", "полилинейных", "форм", "на",
			"$E$", "валентности", "$(p, q)$", ";", "это", "действительно", "линейное", "пространство",
			"над", "полем", "$\\mathbb{R}$", "с", "поточечным", "сложением", "и", "умножением", "на",
			"скаляр"
		]
	],

	/*[
		"Примеры тензоров",
		["пусть", "$U: E^p \\times {\\left( E^* \\right)}^q \\to \\mathbb{R}$", "--",
			"полилинейная", "форма", "$e_1, \\ldots, e_n$", "--", "базис", "$E$", ";",
			"тензором", "полилинейной", "формы", "$U$", "называется", "набор", "чисел",
			"$w_{\\vec{i}}^{\\vec{j}}$", "по", "всем", "$\\vec{i} \\in {(1, \\ldots, n)}^p$",
			"$\\vec{j} \\in {(1, \\ldots, n)}^p$", "из", "утверждения", "о", "соответствии",
			"полилинейной", "формы", "значениям", "на", "базисных", "элементах",
			"(т.е. это координаты полилинейной формы в некотором базисе)"
		]
	],*/

	[
		"Тензорное произведение (полилинейных форм)",
		["пусть", "$U \\in \\Omega_{p_1}^{q_1}(E)$", "$V \\in \\Omega_{p_2}^{q_2}(E)$", ";",
			"тензорным", "произведением", "(полилинейных форм)",
			"$U$", "и", "$V$", "называется", "форма",
			"$U \\otimes V \\mathopen{}\\left(x_1, \\ldots, x_{p_1}, x_{p_1 + 1}, \\ldots, x_{p_1 + p_2}; y^1, \\ldots, y^{q_1}, y^{q_1 + 1}, \\ldots, y^{q_1 + q_2} \\right)\\mathclose{} = U\\mathopen{}\\left(x_1, \\ldots, x_{p_1}; x^1, \\ldots, x^{q_1}\\right)\\mathclose{} V\\mathopen{}\\left(x_{p_1 + 1}, \\ldots, x_{p_1 + p_2}; x^{q_1 + 1}, \\ldots, x^{q_1 + q_2}\\right)\\mathclose{}$"
		]
	],

	// В определениях я не пишу слово "определение", в утверждениях не пишу слово "утверждение".
	//   Поскольку нагружает предложение. Но для теорем и лемм пишу слова "теорема" и "лемма",
	//   это часть названия. Для следствий тоже пишу, иначе не указываю связь.

	[
		"Дистрибутивность тензорного произведения",
		["если", "$U, U_1, U_2 \\in \\Omega_{p_1}^{q_1}(E)$", "$V, V_1, V_2 \\in \\Omega_{p_2}^{q_2}(E)$",
			"$\\alpha, \\beta \\in \\mathbb{R}$", "тогда",
			"$(\\alpha U_1 + \\beta U_2) \\otimes V$", "$=$",
			"$\\alpha (U_1 \\otimes V) + \\beta (U_2 \\otimes V)$", ",",
			"$U \\otimes (\\alpha V_1 + \\beta V_2)$",
			"$=$", "$\\alpha (U \\otimes V_1) + \\beta (U \\otimes V_2)$",
			"(записано сразу две дистрибутивности: справа и слева, определить сторону можно по тому, с какой стороны стоит одно слагаемое)"
		]
	],

	// "(ну тут просто в каждой точке обе формы вычисляются так, что сначала идут аргументы U, затем V, затем W, просто можно показать, как они вычисляются в каждой точке, одинаково)"
	[
		"Ассоциативность тензорного произведения",
		["если", "$U \\in \\Omega_{p_1}^{q_1}(E)$",
			"$V \\in \\Omega_{p_2}^{q_2}(E)$",
			"$W \\in \\Omega_{p_3}^{q_3}(E)$", "тогда",
			"$(U \\otimes V) \\otimes W = U \\otimes (V \\otimes W)$",
			"(достаточно очевидно)"
		]
	],

	// Определение симметрической формы.
	[
		"Симметрическая форма",
		["пусть", "$W \\in \\Omega_{p}^{0}(E)$", ";", "$W$",
			"называется", "симметрической", ",", "если", "она",
			"не", "меняется", "при", "любой", "перестановке",
			"аргументов", ",", "т.е.",
			"$(\\forall x_1, \\ldots, x_p \\in E)$",
			"$(\\forall \\sigma \\in S_p)$",
			"$W(x_1, \\ldots, x_p)$", "$=$",
			"$W(\\sigma(x_1), \\ldots, \\sigma(x_p))$"
		]
	],

	// Определение антисимметрической формы.
	[
		"Антисимметрическая (кососимметрическая) форма",
		["пусть", "$W \\in \\Omega_{p}^{0}(E)$", ";", "$W$",
			"называется", "антисимметрической",
			"(кососимметрической)", ",", "если", "она", "меняет",
			"знак", "при", "любом", "обмене", "(транспозиции)",
			"пары", "её", "аргументов", ",", "т.е.",
			"$(\\forall x_1, \\ldots, x_p \\in E)$",
			"$(\\forall i, j \\in \\{1, \\ldots, p \\}: i < j)$",
			"$W(x_1, \\ldots, x_p)$", "$=$",
			"$-W(x_1, \\ldots, x_{i - 1}, x_j, x_{i + 1}, \\ldots, x_{j - 1}, x_i, x_{j + 1}, \\ldots, x_p)$"
		]
	],

	// Критерий антисимметричности формы.
	[
		"Критерий антисимметричности формы",
		["если", "$W \\in \\Omega_{p}^{0}(E)$", ",", "тогда",
			"$W$", "--", "антисимметрическая", "тогда", "и",
			"только", "тогда", ",", "когда", "на", "любом",
			"наборе", "аргументов", ",", "где", "есть",
			"совпадающие", ",", "она", "равна", "нулю", ",",
			"т.е.", "$(\\forall x_1, \\ldots, x_p \\in E)$",
			"$(\\exists i, j \\in \\{ 1, \\ldots, p \\}: i \\neq j \\land x_i = x_j)$",
			"$W(x_1, \\ldots, x_n) = 0$"
		]
	],

	// Следствие о значении антисимметрической формы от линейно-зависимого набора векторов.


	// Следствие о достаточном условии (на валентность) для обнуления антисимметрической формы

	// Действие перестановки на форму.
	[
		"Действие перестановки на форму",
		["пусть", "$W \\in \\Omega_{p}^{0}(E)$", ",",
			"$\\sigma \\in S_p$",
			"(перестановка, биективное отображение чисел от $1$ до $p$ в себя)",
			"$\\sigma = (i_1, \\dots, i_p)$",
			"(кортеж позиций, куда переходят один, два и так далее)", ";",
			"действием", "перестановки", "$\\sigma$", "на", "форму",
			"$W$", "называется", "форма",
			"$\\sigma W(x_1, \\ldots, x_n)$", "$=$",
			"$W(x_{i_1}, \\ldots, x_{i_p})$"
		]
	],

	// утверждение о действии перестановки на симметрическую форму.
	// утверждение о действии перестановки на антисимметрическую форму.

	// Утверждение о способе получения симметрической и антисимметрической форм из произвольной формы
	// Я могу делить математику на несколько слов только по равенству или по кванторам,
	//   т.к. это имеет смысл, а если делить внутри равенства, то
	//   математика распадается на символы, это сложно учить, смысла меньше, запись менее цельная.
	//   Порядок кванторов важен, он решает, его хорошо запоминать, я это знаю.
	//   Мб с опытом прохождения этой игры я пойму, стоит ли делить на символы, но пока думаю так, пока не хочу делать так, чтобы это было символами, лишенными логики. Хотя у меня слова тоже ставятся в определённом порядке, в котором есть логика. Мб и ок, если разделю символы. Попробую как-нибудь, когда уже всё доделаю и буду учить, посмотрим.
	[
		"Способ получения симметрической и антисимметрической форм из произвольной",
		["если", "$W \\in \\Omega_{p}^{0}(E)$", ",", "тогда",
			"$\\frac{1}{p!} \\sum_{\\sigma \\in S_p} \\sigma W$",
			"--", "симметрическая", "форма",
			"$\\frac{1}{p!} \\sum_{\\sigma \\in S_p} \\operatorname{sgn}(\\sigma) \\sigma W$", "--",
			"антисимметрическая", "форма",
		]
	],

	[
		"Симметризация и антисимметризация формы",
		["пусть", "$W \\in \\Omega_{p}^{0}(E)$", ";",
			"симметризацией", "формы", "$W$", "называется", "форма",
			"$\\operatorname{sym}(W)$", "$=$",
			"$\\frac{1}{p!} \\sum_{\\sigma \\in S_p} \\sigma W$",
			"(сложение форм и умножение на константу поточечные)",
			"(это симметрическая форма, как доказали раньше)", ",",
			"ассиметризацией", "$W$", "называется", "форма",
			"$\\operatorname{asym}(W)$", "$=$",
			"$\\frac{1}{p!} \\sum_{\\sigma \\in S_p} \\operatorname{sgn}(\\sigma) \\sigma W$",
			"(это антисимметрическая форма, как доказали раньше)"
		]
	],

	[
		"Пространство антисимметрических форм",
		["множество", "всех", "антисимметрических", "форм",
			"из", "$\\Omega_p^{0}(E)$", "называется", "пространством",
			"антисимметрических", "форм", "$\\Lambda_p(E)$",
			"(это действительно линейное пространство, т.к. подпространство, потому что замкнуто относительно поточечных сложения форм и умножения на константу, получается тоже антисимметрическая форма)"
		]
	],

	[
		"Внешнее произведение (антисимметрических) форм",
		["пусть", "$U \\in \\Lambda_{p_1}(E)$",
			"$V \\in \\Lambda_{p_2}(E)$", ";", "внешним",
			"произведением", "(антисимметрических)", "форм",
			"называется", "форма", "$U \\wedge V$", "$=$",
			"$\\frac{(p_1 + p_2)!}{p_1! p_2!} \\operatorname{asym}(U \\otimes V)$"
		]
	],

	[
		"Дистрибутивность внешнего произведения форм",
		["если", "$U, U_1, U_2 \\in \\Lambda_{p_1}(E)$",
			"$V, V_1, V_2 \\in \\Lambda_{p_2}(E)$",
			"$\\alpha, \\beta \\in \\mathbb{R}$", "тогда",
			"$(\\alpha U_1 + \\beta U_2) \\wedge V$", "$=$",
			"$\\alpha (U_1 \\wedge V) + \\beta (U_2 \\wedge V)$", ",",
			"$U \\wedge (\\alpha V_1 + \\beta V_2)$",
			"$=$", "$\\alpha (U \\wedge V_1) + \\beta (U \\wedge V_2)$",
			"(записано сразу две дистрибутивности: справа и слева, определить сторону можно по тому, с какой стороны стоит одно слагаемое)"
		]
	],

	[
		"Ассоциативность внешнего произведения форм",
		["если", "$U \\in \\Lambda_{p}(E)$",
			"$V \\in \\Lambda_{q}(E)$",
			"$W \\in \\Lambda_{r}(E)$", "тогда",
			"$(U \\wedge V) \\wedge W$", "$=$",
			"$U \\wedge (V \\wedge W)$", "$=$", 
			"$\\frac{(p + q + r)!}{p! q! r!} \\operatorname{asym}(U \\otimes V \\otimes W)$"
		]
	],

	// TODO: Посмотреть потом доказательства, лекции.
	[
		"Антисимметричность внешнего произведения форм",
		["если", "$U \\in \\Lambda_{p}(E)$",
			"$V \\in \\Lambda_{q}(E)$", "тогда",
			"$U \\wedge V$", "$=$", "${(-1)}^{pq} (V \\wedge U)$"
		]
	],

	// Лекция 10.

	// Лемма о асимметризации тензорного произведения.
	// Критерий линейной зависимости антисимметрических форм валентности 1 (т.е. (1, 0) как полилинейных форм).
	// Утверждение о вычислении внешнего поизведения форм через определитель
	//   Когда напишу это утверждение, сделать пример. Это действительно прикольно, неужели можно реально вычислять? :)
	//   Для этого ещё надо третью домашку прорешать.

	// Утверждение о построении базиса в пространстве асимметрических форм из базиса сопряженного пространства с помощью внешнего произведения
	//   В доказательстве используется утверждение о построении базиса форм валентности (p, 0) через тензорное произведение. Добавить в игру.
	// Следствие о размерности пространства ассиметрических форм.

	[
		"$p$-форма (дифференциальная форма)",
		["пусть", "$U$", "--", "область", "в", "$\\mathbb{R}^n$",
			"$\\Omega: U \\to \\Lambda_p(\\mathbb{R}^n)$", "(в каждой точке антисимметрическая форма валентности $p$)",
			";", "$\\Omega$",, "называется", "$p$-формой", "(дифференциальной формой валентности (степени) $p$)"
		]
	],
	// TODO: действительно ли у \\Lambda_p и у R^n объемлющего для U одно n?

	// Определение пространства дифференциальных форм, с обозначением (мб вторым аргументом надо указать R^n) \\Lambda_p(U, E). И оно, походу, реально линейное, с базисными векторами ... У него векторы -- диф. формы. Даа...
	[
		"Пространство дифференциальных форм",
		["пусть", "$U$", "--", "область", "в", "$\\mathbb{R}^n$",
			"$p \\in \\mathbb{N} \\cup \{ 0 \}", ";",
			"множество", "всех", "$p$-форм", "из", "$U$", "в", "$\\Lambda_p(\\mathbb{R}^n)$",
			"называется", "пространвом", "$p$-форм", "$\\Lambda_p(U, \\mathbb{R}^n)$"
		]
	],

	/*
	[
		"Умножение $p$-формы на функцию",
		["пусть", "$\\Omega \\in : U \\to \\Lambda_p(\\mathbb{R}^n)$", "--", "$p$-форма", "в", "$\\mathbb{R}^n$",
			"(открытое линейносвязное множество, т.е. которое открыто и любые две точки можно соединить непрерывной кривой, интервал, например, или куб без границ)",
			";", "отображение", "$\\Omega: U \\to \\Lambda_p$", "(в каждой точке антисимметрическая форма валентности $p$)", "называется",
			"$p$-формой", "(дифференциальной формой валентности (степени) $p$)"
		]
	],
	*/

	[
		"Разложение дифференциальной формы по простым",
		["если", "$\\Omega \\in \\Lambda_p(U, E)$",
			"(открытое линейносвязное множество, т.е. которое открыто и любые две точки можно соединить непрерывной кривой, интервал, например, или куб без границ)",
			";", "отображение", "$\\Omega: U \\to \\Lambda_p$", "(в каждой точке антисимметрическая форма валентности $p$)", "называется",
			"$p$-формой", "(дифференциальной формой валентности (степени) $p$)"
		]
	],

	[
		"Сильная производная (напоминание из прошлого семестра)",
		["пусть", "$E_1$", ",", "$E_2$", "--", "линейно",
			"нормированные", "пространства", "с", "нормами",
			"${\|\\cdot\|}_{E_1}$", "и", "${\|\\cdot\|}_{E_2}$",
			"$U$", "--", "открытое", "в", "$E_1$", "по", "норме",
			"${\|\\cdot\|}_{E_1}$", ",", "$f: U \\to E_2$", ",",
			"$L: E_1 \\to E_2$", "--", "линейное", "отображение",
			";", "$L$", "называется", "сильной", "производной",
			"$f$", "точке", "$x$", ",", "если", "верно", ",",
			"что", "$(\\forall \\varepsilon > 0)$",
			"$(\\exists \\delta > 0)$",
			"$(\\forall h \\in E_1: {\\lVert h \\rVert}_{E_1} < \\delta)$",
			"${\| f(x + h) - f(x) - L(h) \|}_{E_2} < \\varepsilon h$"
		]
	],

	// Утверждение о представлении сильной производной через ...

	[
		"Дифференцируемость дифференциальной формы",
		["пусть", "$\\Omega \\in \\Lambda_p(U, E)$", ";", "$\\Omega$", "называется",
			"дифференцируемой", "в", "точке $x$", ",", "если", "у", "$\\Omega$", "есть",
			"сильная", "производная", "как", "у", "отображения", "между", "линейными",
			"пространствами", "$E = \\mathbb{R}^n$", "и", "$\\Lambda_p(E)$"
		]
	],

	[
		"Внешний дифференциал дифференциальной формы",
		["пусть", "$\\Omega \\in \\Lambda_p(U, E)$", "$\\Omega$", "дифференцируема", "$\\Omega'$",
			"--", "сильная", "производная", "$\\Omega$",
			"(как отображения из открытого множества в линейном норрмированном пространстве $E = \\mathbb{R}^n$ и ЛНП $\\Lambda_p(E)$)",
			";", "внешним", "дифференциалом", "$\\Omega$", "назывется", "$d\\Omega = (p + 1) \\asym(\\Omega')$"
		]
	],

	// Представление пространства дифференциальных форм как линейно-нормированного пространства.
	// Представление сильной производной дифференциальной формы в базисе.
	[
		"Представление сильной производной дифференциальной формы в базисе",
		["если", "$\\Omega \\in \\Lambda_p(U, E)$", "$\\Omega$", "дифференцируема",
			"$$", ",", "тогда",
			"d\\Omega = \\sum\\limits_{j = 1}^{j = n} \\sum\\limits_{1 \\leqslant i_1 < \\ldots < i_p < n} "
		]
	],


	// Основные свойства внешнего дифференциала. Расписать каждое по отдельности.

	//   Это свойства операции внешнего дифференцирования дифференциальных форм в билетах.

	// Операция дополнения (звездочка Ходжа).
	// Пример (с ~/Звёздочка Ходжа.xpp)
	// Утверждение о двойном применении звездочки Ходжа.

	// Сделать напоминание определения области, больше не включать его определения в тексты.

	[
		"Разложение дифференциальной формы по простым",
		["пусть", "$U$", "--", "область", "в", "$\\mathbb{R}^n$",
			"(открытое линейносвязное множество, т.е. которое открыто и любые две точки можно соединить непрерывной кривой, интервал, например, или куб без границ)",
			";", "отображение", "$\\Omega: U \\to \\Lambda_p$", "(в каждой точке антисимметрическая форма валентности $p$)", "называется",
			"$p$-формой", "(дифференциальной формой валентности (степени) $p$)"
		]
	],

	// Векторное поле.
	[
		"Векторное поле",
		["пусть", "$U$", "--", "область", "в", "$\\mathbb{R}^n$",
			",", "$F: U \\to \\mathbb{R}^n$", ";", "$F$", "называется", "векторным", "полем"
		]
	],

	[
		"Разложение векторного поля по базису",
		["пусть", "$F: U \\to \\mathbb{R}^n$", "--", "векторное",
			"поле", "$(e_1, e_2, \\ldots, e_n)$", "--", "базис",
			"$\\mathbb{R}^n$", ";", "$F$", "можно", "разложить",
			"по", "базису", ":", "существуют",
			"$a_1, \\ldots, a_n: U \\to \\mathbb{R}$", "такие", ",",
			"что", "$F(x) = a_1(x) e_1 + \\ldots + a_n(x) e_n$",
			"(просто элементу $U$ сопоставляем координату поля в этой точке, тогда это верно везде)"
		]
	],

	[
		"Оператор диез",
		["пусть", "$F: U \\to \\mathbb{R}^n$", "--", "векторное",
			"поле", "$(e_1, e_2, \\ldots, e_n)$", "--", "базис",
			"$\\mathbb{R}^n$",
			"$F(x) = a_1(x) e_1 + \\ldots + a_n(x) e_n", ";",
			"F"
		]
	],
	// Оператор бемоль.
	// Примеры, определения гридента, ротора, диверергенции, способ запоминания через наблу.

	// Скалярное поле.

	// \\Lambda_p(E, U) -- пространство дифференциальных форм U -> \\Lambda_p(E)
	[
		"Замкнутая форма",
		["пусть", "$\\Omega \\in \\Lambda_p(U, E)$", ";", "$\\Omega$",
			"называется", "замкнутой", ",", "если", "$d\\Omega$", "$=$", "$0$",
			"(тождественный ноль, т.е. в каждой точке $U$ форма, которая на всех аргументах равна нулю)"
		]
	],

	[
		"Точная форма",
		["пусть", "$\\Omega \\in \\Lambda_p(U, E)$", ";",
			"$\\Omega$", "называется", "точной", ",", "если",
			"существует", "$\\Pi \\in \\Lambda_{p+1}(U, E)$",
			"такая", ",", "что", "$d\\Pi = \\Omega$",
			"(совпадают в любой точке)"
		]
	],

	[
		"Звёздная область",
		["пусть", "$D$", "--", "область", "в", "$\\mathbb{R}^n", ";",
			"$D$", "называется", "звёздной", ",", "если",
			"для", "$\\varphi(x_0, x, t) = x_0 + (1 - t) (x - x_0)$",
			"($\\varphi: D^2 \\times [0, 1] \\to \\mathbb{R}^n$, это параметризация отрезка от $x_0$ до $x$)",
			"$(\\exists x_0 \\in D)$", "$(\\forall x \\in D)$", "$\\varphi(x) \\in D$",
			"(т.е. существует такая точка, что если взять отрезок с концом в ней и в любой другой точке области, он весь лежит в области)",
			"(мы ещё просили непрерывность $\\varphi$, но я пока не знаю, нужно ли это в дальнейшем, у нас в диффурах, вроде, и в интернете на википедии этого не требуют)"
		]
	],

	// Замена переменных в дифференциальных формах, её свойства.

	// Лемма Пуанкаре.
	[
		"Звездообразная область",
		["Пусть", "$D$", "--", "звездная", "область", ",",
			"$\\varphi: D \\to D'$", "--", "диффеоморфизм", ";",
			"$D'$", "называется", "звездообразной", "областью",
			"(", "диффеоморфный", "образ", "звездной", "области",
			")"
		]
	],
	[
		"Лемма Пуанкаре",
		["если", "$D'$", "--", "звездообразная", "область", ",",
			"$\\Omega \\in \\Lambda_p(E, D')$", ",", "$\\Omega$",
			"замкнутая", "и", "гладкая", ",", "тогда", "$\\Omega$",
			"точна"
		]
	],

	// Следствия из леммы Пуанкаре для векторных полей в R^3.
	[
		"Потенциальность векторного поля",
		["если", "$D'$", "--", "звездообразная", "область", ",",
			"$\\Omega \\in \\Lambda_p(E, D')$", ",", "$\\Omega$",
			"замкнутая", "и", "гладкая", ",", "тогда", "$\\Omega$",
			"точна"
		]
	],

	[
		"Соленоидальное векторное поле",
		["если", "$D'$", "--", "звездообразная", "область", ",",
			"$\\Omega \\in \\Lambda_p(E, D')$", ",", "$\\Omega$",
			"замкнутая", "и", "гладкая", ",", "тогда", "$\\Omega$",
			"точна"
		]
	],
	
	[
		"Диффеоморфизм класса $C^k$",
		["если", "$U$", "--", "область", "в", "$\\mathbb{R}^m$", ",", "$V$", "--", "область", "в", "$\\mathbb{R}^n$", ",",
			"$\\varphi: U \\to V$", "$m \\leqslant n$",";", "$\\varphi$", "называется",
			"диффеоморфизмом", "класса", "$C^k$", ",", "если", "$\\varphi$", "биективно", ",",
			"непрерывно", "дифференцируемо", "$k$", "раз", "(", "$k$", "раз",
			"дифференцируемо", "и", "$k$-ые", "частные", "производные", "непрерывны", ")", ",",
			"матрица", "Якоби", "$\\varphi","в", "каждой", "точке", "имеет", "максимальный",
			"возможный", "ранг ($m$)"
		]
	],

	[
		"Элементарное многообразие (клетка)",
		[
			"Пусть $$"
		]
	],

	// Теорема Стокса-Пуанкаре для стандартного куба.
	// Дифференцирование форм на клетке, независимость от параметризации.
	// Теорема Стокса-Пуанкаре для клетки.
	[
		"Теорема Стокса-Пуанкаре для клетки",
		["если", "$M$", "--", "ориентированная клетка", ",",
			"$\\Omega \\in \\Lambda_{n - 1}(M, \\mathbb{R}^n)$", ",", "$\\Omega$",
			"гладкая", ",", "тогда", "$\\int_{\\partial M} \\Omega$", "=",
			"$\\int_M d\\Omega$"
		]
	],
	// Формула Гаусса-Остроградского.
	[
		"Формула Гаусса-Остроградского в терминах дифференциальных форм",
		["если", "$M$", "--", "ориентированная клетка", ",",
			"$\\Omega \\in \\Lambda_2(M, \\mathbb{R}^3)$", ",", "$\\Omega$",
			"гладкая", ",", ",", "тогда", "$\\int_{\\partial M} \\Omega$", "=",
			"$\\int_M d\\Omega$"
		]
	],
	// Формула Стокса. Формула Грина.
	// Форма ориентированного объёма на клетке.
	
	[
		"Сцепленные клетки",
		["пусть", "${\\{ M(i) \\}}_{i = 1}^n$", "--", "связный", "набор", "клеток", ";",
			"${\\{ M(i) \\}}_{i = 1}^n$", "называется", "гладким", "многообразием", ",",
			"если", "любые", "две", "пересекающиеся", "клетки", "набора", "сцеплены"
		]
	],	
	
	// Криволинейные интегралы 1-го и 2-го родов.	
	[
		"Связный набор клеток",
		["пусть", "${\\{ M(i) \\}}_{i = 1}^n$", "--", "связный", "набор", "клеток", ";",
			"${\\{ M(i) \\}}_{i = 1}^n$", "называется", "гладким", "многообразием", ",",
			"если", "любые", "две", "пересекающиеся", "клетки", "набора", "сцеплены"
		]
	],

	[
		"Гладкое многообразие",
		["пусть", "${\\{ M(i) \\}}_{i = 1}^n$", "--", "связный", "набор", "клеток", ";",
			"${\\{ M(i) \\}}_{i = 1}^n$", "называется", "гладким", "многообразием", ",",
			"если", "любые", "две", "пересекающиеся", "клетки", "набора", "сцеплены"
		]
	],
	
	// Лекция 13.
	[
		"Репер",
		["пусть", "$M$", "--", "клетка", ",", "${\\{ e_i(x) \\}}_{}$"
		]
	]

	// Интегрирование форм по дифференцируемому многообразию.
	// Теорема Стокса-Пуанкаре для ориентируемого многообразия с краем.
];