// Code style: предложения и словосочетания в скобочках являются целым словом, они не должны быть длинными, от двух до пяти слов.
//   В запятые не входят пробелы. В интерфейсе и так пространство есть.
//   В определениях для предположений используется "пусть", а в утверждениях "если",
//   поскольку "если", как мне кажется, меньше нагружает текст, чем пусть, но при этом оно
//   не подходит для определений.
//   Математика отделяется в слова по кванторам. Потому вокруг кванторов скобочки.
//   По квантору принадлежности разделения нет. Разделение по кванторам существования и всеобщности
//   Поскольку единицы запоминания в формулировках -- кусочки математики, которые вставляем, по смыслу, как это написать.
//   А в кванторных утверждениях то, как они идут по порядку, потому там делю.
// Корректность определения интеграла для множества бесконечной меры. Могут спросить, когда попросят определение интеграла Лебега.
let analysis_3sem = [
	// Определение интеграла Лебега для ограниченных функций
	// Определение интеграла Лебега для неотрицательных функций
	// Определение интеграла Лебега для произвольных функций
	[
		"Основная теорема об интеграле Лебега от ограниченных функций",
		["если", "мера", "$E$", "конечна", ",", "$f$", "измерима", "и", "ограничена",
			"на", "$E$", ",", "тогда", "$f$", "интегрируема", "по", "Лебегу", "на", "$E$", "и",
			"$\\int\\limits_E f(x) d\\mu(x) = \\lim\\limits_{\\Delta(Q) \\to 0} S(Q, f, \\{ t_i \\})$",
			"(интеграл равен пределу интегральных сумм)",
			";", "равенство", "означает", ",", "что", "выполнено", "утверждение",
			"$(\\forall \\varepsilon > 0)$", "$(\\exists \\delta > 0)$",
			"$(\\forall Q, \\Delta(Q) < \\delta)$",
			"$(\\forall \\{ t_i \\}, t_i \\in E_i)$",
			"$\\left| \\int\\limits_E f(x) d\\mu(x) - \\sum\\limits_{i = 1}^n f(t_i) \\mu(E_i) \\right| < \\varepsilon$"
		]
	],
	[
		"Основная теорема об интеграле Лебега от неограниченных неотрицательных функций",
		["если", "мера", "$E$", "конечна", ",", "$f$", "измеримая", ",", "неограниченная",
			"и", "неотрицательная", "на", "$E$", ",", "тогда", "$f$", "интегрируема", "по",
			"Лебегу", "на", "$E$", "и",
			"$\\int\\limits_E f(x) d\\mu(x) = \\lim\\limits_{\\Delta(Q) \\to 0} S(Q, f, \\{ t_i \\})$",
			"(интеграл равен пределу интегральных сумм)"
		]
	],
	[
		"Линейность интеграла Лебега",
		["если", "мера", "$E$", "конечна", ",", "$f_1$", "и", "$f_2$", "суммируемы", "на",
			"$E$", ",", "$c_1, c_2 \\in \\mathbb{R}$", ",", "тогда",
			"$с_1 f_1 + c_2 f_2$", "тоже", "суммируема", "на", "$E$", "и",
			"$\\int\\limits_E (c_1 f_1(x) + c_2 f_2(x)) d\\mu(x) = c_1 \\int\\limits_E f_1(x) d\\mu(x) + c_2 \\int\\limits_E f_2(x) d\\mu(x)$"
		]
	],
	[
		"Монотонность интеграла Лебега",
		["если", "мера", "$E$", "конечна", ",", "$f_1$", "и", "$f_2$", "суммируемы", "на",
			"$E$", ",", "$(\\forall x \\in E)$", "$f_1(x) \\leqslant f_2(x)$", ",", "тогда",
			"$\\int\\limits_E f_1(x) d\\mu(x) \\leqslant \\int\\limits_E f_2(x) d\\mu(x)$"
		]
	],

	// Лекция 4.

	[
		"Теорема Лебега о переходе к пределу в интеграле Лебега",
		["если", "мера", "$E$", "конечна", ",", "$\\{f_n\\}_{n = 1}^\\infty$", "измеримы",
			"на", "$E$", ",", "$\\lim\\limits_{n \\to \\infty} f_n(x) = f(x)$",
			"почти", "всюду", "на", "$E$", "(поточечный предел почти всюду)", ",",
			"$|f_n(x)| \\leqslant F(x)$", "почти", "всюду", "на", "$E$", "для", "любого",
			"$n \\in \\mathbb{N}$", ",", "$F$", "суммируема", "на", "$E$", ",", "тогда",
			"$f$", "суммируема", "на", "$E$", "и",
			"$\\lim\\limits_{n \\to \\infty} \\int\\limits_E f_n(x) d\\mu(x) = \\int\\limits_E f(x) d\\mu(x)$"
		]
	],
	[
		"Теорема Леви о монотонной сходимости",
		["если", "мера", "$E$", "конечна", ",", "$\\{f_n\\}_{n = 1}^\\infty$", "измеримы", "и", "неотрицательны",
			"на", "$E$", ",", "$\\{f_n(x)\\}_{n = 1}^\\infty$", "неубывающая", "почти", "всюду", "на",
			"$E$", ",", "тогда",
			"$\\int\\limits_E \\lim\\limits_{n \\to \\infty} f_n(x) d\\mu(x) = \\lim\\limits_{n \\to \\infty} \\int\\limits_E f_n(x) d\\mu(x)$"
		]
	],
	[
		"Теорема Фату",
		["если", "мера", "$E$", "конечна", ",", "$\\{f_n\\}_{n = 1}^\\infty$", "измеримы",
			"на", "$E$", ",", "$\\lim\\limits_{n \\to \\infty} f_n(x) = f(x)$", "почти",
			"всюду", "на", "$E$", ",", "$f_n(x) \\geqslant 0$", "для", "любого",
			"$n \\in \\mathbb{N}$", "почти", "всюду", "на", "$E$", ",", "тогда",
			"$\\int\\limits_E f(x) d\\mu(x) \\leqslant \\underline{\\lim}\\limits_{n \\to \\infty} \\int\\limits_E f_n(x) d\\mu(x)$"
		]
	],
	// Вспомнить для себя определения понятий предела множества.
	[
		"Корректность определения интеграла Лебега по множеству бесконечной меры",
		["если", "$\\mu(E) = +\\infty$", ",", "$f$", "измерима", "и", "неотрицательна",
			"на", "$E$", ",", "тогда", "для", "любых", "двух", "неубывающих",
			"последовательностей", "множеств", "конечной", "меры",
			"$\\{ E_m \\}_{m = 1}^\\infty$", ",", "$\\{ E_m' \\}_{m = 1}^\\infty$", ",",
			"для", "которых", "верно", ",", "что",
			"$\\lim\\limits_{m \\to \\infty} E_m = \\lim\\limits_{m \\to \\infty} E'_m = E$",
			",",
			"$\\lim\\limits_{m \\to \\infty} \\int\\limits_{E_m} f(x) d\\mu(x) = \\lim\\limits_{m \\to \\infty} \\int\\limits_{E'_m} f(x) d\\mu(x)$"
		]
	],
	[
		"Определение подграфика",
		["пусть", "$f$", "неотрицательна", "на", "$E$", ";",
			"подграфиком", "$f$", "на", "$E$", "называется", "множество",
			"$D_{f, E} = \\{ (x, y) \\mid x \\in E, y \\in [0, f(x)] \\}$"
		]
	],
	[
		"Лемма о мере подграфика",
		["если", "$E$", "измеримо", ",", "$f$", "суммируемая", "и", "неотрицательная",
			"на", "$E$", ",", "тогда", "её", "подграфик", "измерим", "на", "$E$", "и",
			"$\\mu\\left(D_{f, E}\\right) = \\int\\limits_E f(x) d\\mu(x) = \\int\\limits_{[0, +\\infty]} \\mu_X(\\{ x \\mid f(x) \\geqslant y \\}) d\\mu_Y(y)$",
			",", "здесь", "$X = \\mathbb{R}^n$", ",", "$Y = \\mathbb{R}^m$", ",", "$\\mu_T(A)$", "--", "мера", "Лебега", "множества", "$A$", "для", "$T$"
		]
	],
	[
		"Теорема Фубини",
		["если", "$E$", "измеримо", ",", "$f$", "суммируемая", "на", "$E$", ",", "тогда",
			"её", "подграфик", "измерим", "на", "$E$", "и",
			"$\\mu\\left(D_{f, E}\\right) = \\int\\limits_E f(x) d\\mu(x) = \\int\\limits_{[0, +\\infty]} \\mu_X(\\{ x \\mid f(x) \\geqslant y \\}) d\\mu_Y(y)$",
			",", "здесь", "$X = \\mathbb{R}^n$", ",", "$Y = \\mathbb{R}^m$"
		]
	],
]