// Code style: предложения и словосочетания в скобочках являются целым словом, они не должны быть длинными, от двух до пяти слов.
//   В запятые не входят пробелы. В интерфейсе и так пространство есть.
analysis_3sem = [
	[
		"Теорема Лебега о переходе к пределу в интеграле Лебега",
		["если", "мера", "$E$", "конечна", ",", "$\\{f_n\\}_{n = 1}^\\infty$", "измеримы",
			"на", "$E$", ",", "$\\lim\\limits_{n \\to \\infty} f_n(x) = f(x)$",
			"почти", "всюду", "на", "E", "(поточечный предел почти всюду)", ",",
			"$|f_m(x)| \\leqslant F(x)$", "почти", "всюду", "на", "$E$", "для",
			"любого", "$m \\in \\mathbb{N}$", ",", "$F$", "суммируема", "на", "$E$", ",",
			"тогда", "$f$", "суммируема", "на", "$E$", "и",
			"$\\int\\limits_E f(x) d\\mu(x) = \\lim\\limits_{m \\to \\infty} \\int\\limits_E f_m(x) d\\mu(x)$"
		]
	]
]