//  Code style: предложения и словосочетания в скобочках являются целым словом, они не должны быть длинными, от двух до пяти слов.
//   В запятые не входят пробелы. В интерфейсе и так пространство есть.
//   В определениях для предположений используется "пусть", а в утверждениях "если",
//   поскольку "если", как мне кажется, меньше нагружает текст, чем пусть, но при этом оно
//   не подходит для определений.
//   Математика отделяется в слова по кванторам. Потому вокруг кванторов скобочки.
//   По квантору принадлежности разделения нет. Разделение по кванторам существования и всеобщности
//   Поскольку единицы запоминания в формулировках -- кусочки математики, которые вставляем, по смыслу, как это написать.
//   А в кванторных утверждениях то, как они идут по порядку, потому там делю.
// Корректность определения интеграла для множества бесконечной меры. Могут спросить, когда попросят определение интеграла Лебега.
let analysis_4sem = [
    // 1. Теорема Римана об осцилляции.

    [
        "Носитель функции",
        [
            "пусть",
            "$f : E \\to \\mathbb{R}$",
            "$E \\subseteq \\mathbb{R}$",
            ";",
            "носителем функции $f$ называется $\\supp f$",
            "$=$",
            "$\\Cl({ x \\in \\mathbb{R}: f(x) \\neq 0 })$",
            "(замывание множества точек, где функция не ноль)"
        ]
    ],
    [
        "Финитная функция",
        [
            "пусть",
            "$f : E \\to \\mathbb{R}$",
            ";",
            "функция $f$ называется финитной, если её носитель ограничен"
        ]
    ],

    [
        "Лемма о замыкании множества непрерывных финитных функций",
        [
            "Множество непрерывных финитных функций всюду плотно в $L_1(\\mathbb{R})$, т.е. его замыкание совпадает с $L_1(\\mathbb{R})$"
        ]
    ],

    [
        "Лемма о непрерывности суммируемой в среднем относительно сдвига",
        [
            "если",
            "$f$",
            "суммируема",
            "на",
            "$\\mathbb{R}$",
            ",",
            "тогда",
            "она",
            "непрерывна",
            "в",
            "среднем",
            "относительно",
            "сдвига",
            ",",
            "т.е.",
            "$\\lim_{t \\to 0}$",
            "$\\int_{\\mathbb{R}}$",
            "$\\vert f(x + t) - f(x) \\rvert$",
            "$d\\mu(x)$",
            "$=$",
            "$0$"
        ]
    ],
    // TODO: написать определение L_n нормально. И до этого утверждения.
    // При некоторых t формула f(x + t) - f(x) может быть беск - беск, для таких t как-бы функция не определена.
    //   Но если бесконечностей нет, то всё точно в шоколаде. Можно их предварительно исключить, они составляют
    //   множество меры ноль, т.к. функция суммируема (иначе автоматически не суммируема, интеграл бесконечен,
    //   т.к. mu(E_0) != 0).
    ["Доказательство",["0",")","суммируемая","на","$S$","лежит","в","$L_1(S)$",":","$f$","-","суммируема","на","множестве","$S$","$\\stackrel{\\text{def}}{\\Leftrightarrow}$","$f_+$","и","$f_-$","суммируемы","на","$S$",",","$\\lvert f \\rvert$","$=$","$f_+$","$+$","$f_-$","$\\Rightarrow$","$\\lvert f \\rvert$","суммируем","на","$S$","(","по","линейности",",","интеграл","$|f|$","конечен","как","сумма","конечных",")","$\\Rightarrow$","$f \\in L_1(S)$","&br&","1",")","докажем","для","$[a, b]$","и","$f \\in L_1[a, b]$",",","что","$\\lim_{t \\to 0+}$","$\\int_a^{b - t}$","$\\lvert f(x + t) - f(x) \\rvert$","$d\\mu(x)$","$=$","$0$",",","т.е.","&br&","$(\\forall \\varepsilon > 0)$","$(\\exists \\delta > 0)$","$(\\forall t \\in (0; \\delta))$","$\\int_a^{b - t}$","$\\lvert f(x + t) - f(x) \\rvert$","$d\\mu(x)$","$<$","$\\varepsilon$","&br&","1.1",")","применим","лемму","о","замыкании","множества","непрерывных","финитных","функций","для","$\\frac{\\varepsilon}{3}$",",","получим","$g \\in C[a, b]$",":","&br&","$(\\exists g \\in C[a, b])$","${\\| f - g \\|}_{L_1[a, b]}$","$=$","$\\int_a^b$","$\\lvert f(x) - g(x) \\rvert$","$d\\mu(x)$","$<$","$\\frac{\\varepsilon}{3}$","(","лемма","говорит","о","непрерывных","на","всей","прямой","и","$L_1(R)$",",","но","можно","нашу","доопределить","нулем",",","тогда","функция","в","$L_1(\\mathbb{R})$",",","та","же","непрерывная","подойдет",":","непрерывная","всюду","на","отрезке","тоже","непрерывна",",","интеграл","неотрицательной","по","всей","прямой","не","меньше","интеграла","по","отрезку",")","&br&","1.2.",")","применим","теорему","Кантора","о","равномерной","непрерывности","к","$g$","для","$\\frac{\\varepsilon}{3 \\cdot (b - a)}$",",","получим","$\\delta$",":","&br&","$(\\exists \\delta > 0)$","$(\\forall x_1, x_2 \\in [a, b]: \\lvert x_1 - x_2 \\rvert < \\delta)$","$\\lvert g(x_1) - g(x_2) \\rvert$","$<$","$\\frac{\\varepsilon}{3 \\cdot (b - a)}$","&br&","1.3",")","покажем",",","что","подойдет","минимум","из","$\\delta$","и","$b - a$",",","т.е.","&br&","$(\\forall t \\in (0; \\delta))$","$\\int_a^{b - t}$","$\\lvert f(x + t) - f(x) \\rvert$","$d\\mu(x)$","$<$","$\\varepsilon$","(","минимум","с","$b - a$",",","чтобы","$x + t$","при","$x$","из","$[a, b-t]$","лежало","в","$[a, b]$",")","&br&","1.3.1",")","приблизим","с","помощью","$g$",":","&br&","$\\int_a^{b - t}$","$\\lvert f(x + t) - f(x) \\rvert$","$d\\mu(x)$","$=$","&br&","$\\int_a^{b - t}$","$\\lvert f(x + t) - g(x + t) + g(x + t) - g(x) + g(x) - f(x) \\rvert$","$d\\mu(x)$","$\\leqslant$","&br&","$\\int_a^{b - t}$","$($","$\\lvert f(x + t) - g(x + t) \\rvert$","$+$","$\\lvert g(x + t) - g(x) \\rvert$","$d\\mu(x)$","+","$\\lvert g(x) - f(x) \\rvert$","$)$","$d\\mu(x)$","$\\leqslant$","&br&","$\\int_a^{b - t}$","$\\lvert f(x + t) - g(x + t) \\rvert$","$d\\mu(x)$","+","$\\int_a^{b - t}$","$\\lvert g(x + t) - g(x) \\rvert$","$d\\mu(x)$","+","$\\int_a^{b - t}$","$\\lvert g(x) - f(x) \\rvert$","$d\\mu(x)$","(","по","неравенству","треугольника","и","монотонности","интеграла",")","&br&","1.3.2.",")","оценим","интегралы","с","модулем","разности","$f$","и","$g$","через","условие","на","подбор","$g$",":","&br&","$\\int_a^{b - t}$","$\\lvert f(x + t) - g(x + t) \\rvert$","$d\\mu(x)$","$=$","$\\int_{a + t}^b$","$\\lvert f(x) - g(x) \\rvert$","$d\\mu(x)$","$\\leqslant$","$\\int_a^b$","$\\lvert f(x) - g(x) \\rvert$","$d\\mu(x)$","$<$","$\\frac{\\varepsilon}{3}$",",","&br&","$\\int_a^{b - t}$","$\\lvert f(x) - g(x) \\rvert$","$d\\mu(x)$","$\\leqslant$","$\\int_a^b$","$\\lvert f(x) - g(x) \\rvert$","$d\\mu(x)$","$<$","$\\frac{\\varepsilon}{3}$","(","по","аддитивности","и","монотонности","интеграла",")","&br&","1.3.3",")","интеграл","модуля","разности","$g$","оценим","через","теорему","Кантора",":","&br&","$\\int_a^{b - t}$","$\\lvert g(x + t) - g(x) \\rvert$","$d\\mu(x)$","$\\leqslant$","$\\int_a^b$","$\\lvert g(x + t) - g(x) \\rvert$","$d\\mu(x)$","$\\leqslant$","$\\int_a^b$","$\\frac{\\varepsilon}{3 \\cdot (b - a)}$","$d\\mu(x)$","$=$","$\\frac{\\varepsilon}{3}$","(","по","аддитивности","и","монотонности",",","оценить","можем",",","т.к.","$x$","и","$x + t$","в","$[a, b]$",")","&br&","1.3.4",")","Сумма","всех","частей","меньше","$\\varepsilon$",",","ч.т.д.","&br&","2",")","Докажем","для","исходного","$f$",",","т.е.","&br&","$(\\forall \\varepsilon > 0)$","$(\\exists \\delta > 0)$","$(\\forall t \\in (-\\delta; \\delta) \\setminus \\{ 0 \\})$","$\\int_{\\mathbb{R}}$","$\\lvert f(x + t) - f(x) \\rvert$","$d\\mu(x)$","$<$","$\\varepsilon$","&br&","2.1.",")","$\\lvert f(x + t) - f(x) \\rvert$","суммируемо","на","$\\mathbb{R}$",":","$\\lvert f(x + t) - f(x) \\rvert$","$\\leqslant$","$\\lvert f(x + t) \\rvert + \\lvert f(x) \\rvert$","(","по","монотонности","и","линейности",",","оба","интеграла","по","$\\mathbb{R}$","конечны",")","&br&","2.2.",")","из","определения","интеграла","по","множеству","бесконечной","меры","найдем","отрезок",",","вне","которого","интеграл","меньше","$\\frac{\\varepsilon}{2}$",":","&br&","$\\int_{\\mathbb{R}}$","$\\lvert f(x + t) - f(x) \\rvert$","$d\\mu(x)$","$=$","$\\lim_{N \\to \\infty}$","$\\int_{-N}^N$","$\\lvert f(x + t) - f(x) \\rvert$","$d\\mu(x)$","$\\Rightarrow$","&br&","$\\int_{\\mathbb{R}}$","$\\lvert f(x + t) - f(x) \\rvert$","$d\\mu(x)$","$-$","$\\lim_{N \\to \\infty}$","$\\int_{-N}^N$","$\\lvert f(x + t) - f(x) \\rvert$","$d\\mu(x)$","$=$","$\\lim_{N \\to \\infty}$","$\\int_{\\mathbb{R} \\setminus [-N, N]}$","$\\lvert f(x + t) - f(x) \\rvert$","$d\\mu(x)$","$=$","$0$","$\\Rightarrow$","&br&","$(\\exists n \\in \\mathbb{N}) (\\forall N > n)$","$\\int_{\\mathbb{R} \\setminus [-N, N]} | f(x + t) - f(x) | d\\mu(x) < \\frac{\\varepsilon}{2}$","$\\Rightarrow$","&br&","$(\\exists N = n + 1) \\int_{\\mathbb{R} \\setminus [-N, N]} | f(x + t) - f(x) | d\\mu(x) < \\frac{\\varepsilon}{2}$","&br&","2.3.",")","Ограничение","$f$","на","$[a, b]$","по","доказанному","даёт","маленький","интеграл",",","меньше","$\\frac{\\varepsilon}{2}$",":","$g(x) = f(x) I(-N - 1 \\leqslant x \\leqslant N + 1)$",",","$a = -N - 1$",",","$b = N + 1$",",","где","$I$","--","индикатор","(","на","отрезке","$[-N-1, N+1]$","будет","$f(x)$",",","вне","будет","ноль",")",",","$|g(x)|$","суммируем","на","$[-N-1, N+1]$",",","иначе","интеграл","бесконечен",",","т.к.","всё","равно","существует",",","но","тогда","и","$|f(x)|$","не","суммируем","на","$\\mathbb{R}$","по","аддитивности","интеграла",",","противоречие",";","значит",",","$g \\in L_1[a, b]$",",","по","доказанному","ранее","$(\\exists \\delta \\in (0, 1)) (\\forall h: h \\in (0, \\delta))$","$\\int_{[-N-1, N+1-h]} | g(x + h) - g(x) | d\\mu(x) < \\frac{\\varepsilon}{2}$","(","при","$\\delta \\geqslant 1$","можем","заменить","на","$\\frac{1}{2}$",",","т.к.","для","$h$","с","таким","расстоянием","условие","тоже","выполнено",")","&br&","Возьмём","то","же","самое","$\\delta$",",","тогда","$(\\forall t: t \\in (0, \\delta))$","$\\int_{\\mathbb{R}} | f(x + t) - f(x) | d\\mu(x)$","$= \\int_A | f(x + t) - f(x) | d\\mu(x) + \\int_B | f(x + t) - f(x) | d\\mu(x)$",",","где","$A = \\{ x \\in \\mathbb{R} : x \\in [-N - 1, N + 1] \\land x + t \\in [-N-1, N + 1] \\} \\subset [-N-1, N+1]$","(","на","самом","деле",",","это","пересечение","отрезков",",","$[-N-1, N+1]$","и","$[-N-1-t, N+1-t]$",",","потому","это","либо","отрезок",",","либо","пустое","множество",",","потому","всегда","измеримо",")",",","$A = [-N-1, N+1-t]$",",","$B = $","$\\{ x \\in \\mathbb{R} : x \\notin [-N - 1, N + 1] \\lor x + t \\notin [-N-1, N + 1] \\}$.","Заметим",",","что","если","$x$","или","$x + t$","не","попадают","в","$[-N-1, N+1]$",",","то","она","оба","не","попадают","в","$[-N, N]$",",","т.к.","$|\\delta| < 1$",":","$\\left[ \\begin{array}{ll} x < -N - 1, \\\\ x > N + 1, \\\\ x + t < -N - 1, \\\\ x + t > N + 1 \\end{array} \\right.$","$\\Rightarrow$","$\\left[ \\begin{array}{ll} x + t < -N - 1 + t < -N, \\\\ x + t > N + 1 + t > N + 1, \\\\ x < -N - 1 - t < -N, \\\\ x > N + 1 - t > N \\end{array} \\right.$",",","потому","$x \\not\\in [-N, N]$",",","$x \\in \\mathbb{R} \\setminus [-N, N]$.","Тогда","$\\int_A | f(x + t) - f(x) | d\\mu(x) = \\int_{[-N-1, N+1-t]} | g(x + t) - g(x) | d\\mu(x) < \\frac{\\varepsilon}{2}$",",","по","аддитивности","интеграла","Лебега","$\\int_B | f(x + t) - f(x) d\\mu(x) \\leqslant \\int_{\\mathbb{R} \\setminus [-N, N]} | f(x + t) - f(x) d\\mu(x) < \\frac{\\varepsilon}{2}$",",","$\\int_{\\mathbb{R}} | f(x + t) - f(x) | d\\mu(x) < \\varepsilon$.","Для","$t$","из","$(-\\delta, 0)$","можно","доказать",",","сделав","замену","$u = x + t$",",","домножив","под","модулем","на","$-1$",",","тогда","сведем","к","доказательству","для","положительного","$-t$."]],
    
	["Теорема Римана об осцилляции",["если","$I$","--","промежуток","(","возможно",",","неограниченный",")",",","$f \\in L_1(I)$",",","тогда","$\\lim_{\\lambda \\to \\infty}$","$\\int_I$","$f(x)$","$\\cos(\\lambda x)$","$d\\mu(x)$","$=$","$0$","и","$\\lim_{\\lambda \\to \\infty}$","$\\int_I$","$f(x)$","$\\sin(\\lambda x)$","$d\\mu(x)$","$=$","$0$"]],
	["Доказательство",["1",")","доопределим","$f(x)$","нулем","вне","промежутка",",","чтобы","получить","интеграл","по","всей","прямой",":","&br&","$g(x) = f(x) \\cdot \\mathbb{I}(x \\in I)$","$\\Rightarrow$","&br&","$\\int_I f(x) \\cos(\\lambda x) d\\mu(x) = \\int_{\\mathbb{R}} g(x) \\cos(\\lambda x) d\\mu(x)$","&br&","2",")","обозначим","$J(\\lambda) = \\int_{\\mathbb{R}} f(x) \\cos(\\lambda x) d\\mu(x)$","&br&","3",")","получим","с","помощь","замены","ещё","одно","представление","$J$",",","чтобы","подогнать","под","лемму",":","&br&","$x = t + \\frac{\\pi}{\\lambda}$","$\\Rightarrow$","&br&","$J(\\lambda)$","$=$","$\\int_{\\mathbb{R}} f\\mathopen{}\\left(t + \\frac{\\pi}{\\lambda} \\right)\\mathclose{} \\cos(\\lambda t + \\pi) d\\mu(t)$","$=$","$-\\int_{\\mathbb{R}} f\\mathopen{}\\left(t + \\frac{\\pi}{\\lambda} \\right)\\mathclose{} \\cos(\\lambda t) d\\mu(t)$","&br&","4",")","Сложим","представления",",","поделив","пополам",":","&br&","$J(\\lambda)$","$=$","$\\frac{1}{2}$","$\\int_{\\mathbb{R}}$","$f\\mathopen{}\\left(t + \\frac{\\pi}{\\lambda}\\right)\\mathclose{} - f(x)) \\cos(\\lambda t)$","$d\\mu(x)$","&br&","5",")","Сводим","к","лемме",":","&br&","$|J(\\lambda)| \\leqslant \\frac{1}{2} \\int_{\\mathbb{R}} f\\mathopen{}\\left(t + \\frac{\\pi}{\\lambda}\\right)\\mathclose{} - f(x)) d\\mu(x) \\to 0$","при","$\\lambda \\to \\infty$","$\\Rightarrow$","&br&","$\\lim_{\\lambda \\to \\infty} J(\\lambda)$","$=$","$0$","(","по","лемме","о","непрерывности","суммируемой","в","среднем","относительно","сдвига","и","теореме","о","пределе","зажатой","функции",")","&br&","6",")","аналогично","докажем","для","синуса"]],
    
    // 2. Представление частичной суммы ряда Фурье интегралом с ядром Дирихле. Принцип локализации.

    // Представление частичной суммы ряда Фурье интегралом с ядром Дирихле.
    [
        "Пространство $L_{2 \\pi}$",
        [
            "Будем писать $f \\in L_{2 \\pi}$, имея в виду, что $f \\in L_1[-\\pi, \\pi]$ и $2\\pi$-периодическая"
        ]
    ],
    [
        "Лемма о представлении частичной суммы ряда Фурье интегралом с ядром Дирихле",
        [
            "Если $f \\in L_{2\\pi}$, $S_n(f, x)$ -- $n$-ая частичная сумма тригонометрического ряда",
            ",",
            "Фурье функции $f$ в точке $x$",
            ",",
            "$D_n(u) = \\frac{1}{2} + \\sum_{k = 1}^n \\cos(ku) =$",
            "$\\frac{\\sin\\mathopen{}\\left(\\mathopen{}\\left( n + \\frac{1}{2} \\right)\\mathclose{} u \\right)\\mathclose{}}{2 \\sin\\mathopen{}\\left( \\frac{u}{2} \\right)\\mathclose{}}$",
            "(ядро Дирихле)",
            "тогда",
            "$S_n(f, x) =$",
            "$\\frac{1}{\\pi} \\int_{-\\pi}^{\\pi} f(t) D_n(x - t) d\\mu(t) =$",
            "$\\frac{1}{\\pi} \\int_{-\\pi}^{\\pi} f(x + u) D_n(u) d\\mu(u) =$",
            "$\\frac{1}{\\pi} \\int_0^{\\pi} (f(x + u) + f(x - u)) D_n(u) d\\mu(u)$."
        ]
    ],
    // Когда идею понял, вряд ли забудешь.. Потому пока оставлю, не хочется оформлять. Попозже оформлю, мб дома.
    /*
	[
		"Доказательство",
		[
			"$S_n(f, x) = \\frac{1}{\\pi} \\int_{-\\pi}^{\\pi} f(t) \\mathopen{}\\left( \\frac{1}{2} + \\sum_{k = 1}^n$"
		]
	],*/

    // $g: ?? \\to ??$
    [
        "Лемма о равномерном стремлении к нулю коэффициентов Фурье функции-свертки",
        [
            "Если",
            "$f \\in L_{2 \\pi}$",
            ",",
            "$g$",
            "--",
            "измерима",
            ",",
            "$2\\pi$-периодична",
            "и",
            "ограничена",
            ",",
            "$\\chi(x, t)$",
            "$=$",
            "$f(x + t)$",
            "$g(t)$",
            ",",
            "$a_n(x)$",
            ",",
            "$b_n(x)$",
            "--",
            "коэффициенты",
            "Фурье",
            "функции",
            "$h_x(t)$",
            "$=$",
            "$f(x + t)$",
            "$g(t)$",
            "(",
            "последовательность",
            "функций",
            ",",
            "выдающих",
            "в",
            "кажой",
            "точке",
            "$n$-ый",
            "коэффициент",
            "Фурье",
            "свертки",
            "при",
            "заданном",
            "$x$",
            ")",
            ",",
            "тогда",
            "$a_n$",
            "и",
            "$b_n$",
            "стремятся",
            "к",
            "тождественному",
            "нулю",
            "равномерно",
            "на",
            "$[-\\pi, \\pi]$"
        ]
    ],
	["Доказательство",["Хотим","доказать",":","$(\\forall \\varepsilon > 0)$","$(\\exists N \\in \\mathbb{N})$","$(\\forall n > N)$","$(\\forall x \\in [-\\pi, \\pi])$","$\\lvert a_n(x) - 0 \\rvert$","$<$","$\\varepsilon$","и","аналогичное","для","$b_n$",".","Обозначим","$w(h, x)$","$=$","$\\int_{-\\pi}^{\\pi} \\lvert g_x(t + h) - g_x(t) \\rvert d\\mu(t)$",",","$w(\\delta, x)$","$=$","$\\sup_{0 \\leqslant h \\leqslant \\delta}$","$\\int_{-\\pi}^{\\pi} \\lvert \\chi(x, t + h) - \\chi(x, t) \\rvert d\\mu(t)$",".","Оценим","$a_n$","и","$b_n$",":","$a_n(x)$","$=$","$\\frac{1}{\\pi}$","$\\int_{-\\pi}^{\\pi} g_x(t) \\cos(nt) d\\mu(t)$","$=$","$\\frac{1}{\\pi}$","$\\int_{-\\pi}^{\\pi} \\chi(x, t) \\cos(nt) d\\mu(t)$",";","сделаем","замену","$t$","$=$","$u$","$+$","$\\frac{\\pi}{n}$",":","$\\frac{1}{\\pi}$","$\\int_{-\\pi - \\frac{\\pi}{n}}^{\\pi - \\frac{\\pi}{n}} \\chi\\mathopen{}\\left(x, u + \\frac{\\pi}{n} \\right)\\mathclose{} \\cos(nu + \\pi) d\\mu(u)$","$=$","$\\frac{1}{\\pi}$","$-\\int_{-\\pi}^{\\pi} \\chi\\mathopen{}\\left(x, u + \\frac{\\pi}{n} \\right)\\mathclose{} \\cos(nu) d\\mu(u)$","(","границы","интегрирования","можно","так","поменять",",","т",".","к",".","у","периодической","функции","интегралы","по","любым","двум","периодам","совпадают",")",";","Тогда","считая","полусумму",",","получим","$a_n(x)$","$=$","$\\frac{1}{2}$","$\\frac{1}{\\pi}$","$\\int_{-\\pi}^{\\pi} \\left( -\\chi\\mathopen{}\\left(x, u + \\frac{\\pi}{n} \\right)\\mathclose{} + \\chi\\mathopen{}\\left(x, u \\right)\\mathclose{} \\right) \\cos(nu) d\\mu(u)$",",","$\\lvert a_n(x) \\rvert$","$\\leqslant$","$\\frac{1}{2 \\pi}$","$\\int_{-\\pi}^{\\pi} \\left| -\\chi\\mathopen{}\\left(x, u + \\frac{\\pi}{n} \\right)\\mathclose{} + \\chi\\mathopen{}\\left(x, u \\right)\\mathclose{} \\right| \\lvert \\cos(nu) \\rvert d\\mu(u)$","$\\leqslant$","$\\frac{1}{2 \\pi}$","$\\int_{-\\pi}^{\\pi} \\left| \\chi\\mathopen{}\\left(x, u + \\frac{\\pi}{n} \\right)\\mathclose{} - \\chi\\mathopen{}\\left(x, u \\right)\\mathclose{} \\right| d\\mu(u)$","$\\leqslant$","$\\frac{1}{2 \\pi}$","$w\\mathopen{}\\left( \\frac{\\pi}{n}, x \\right)\\mathclose{}$","Аналогично","оценим","$b_n(x)$",",","получим","$\\lvert b_n(x) \\rvert$","$\\leqslant$","$\\frac{1}{2 \\pi}$","$w\\mathopen{}\\left( \\frac{\\pi}{n}, x \\right)\\mathclose{}$",".","&br&","Оценим","$w\\mathopen{}\\left( \\frac{\\pi}{n}, x \\right)\\mathclose{}$",":","знаем",",","что","$g$","ограничена",",","тогда","$(\\exists M > 0)$","$(\\forall t \\in \\mathbb{R})$","$\\lvert g(t) \\rvert$","$\\leqslant$","$M$",";","по","лемме","о","замыкании","множества","непрерывных","финитных","функций","$(\\exists \\tilde{f} \\in C[-\\pi, \\pi])$","${\\| f - \\tilde{f} \\|}_{L_1[-\\pi, \\pi]}$","$<$","$\\frac{\\varepsilon}{4M}$",",","обозначим","$f_1 = \\tilde{f}$",",","$f_2 = f - \\tilde{f}$",",","$f_1$","ограничена","на","$[-\\pi, \\pi]$",",","т.к.","достигает","на","нём","минимум","и","максимум","по","теореме","Вейерштрасса",",","пусть","ограничена","$B$",",","${\\| f_2 \\|}_{L_1[a, b]}$","$<$","$\\frac{\\varepsilon}{4M}$",";","по","лемме","о","непрерывности","суммируемой","в","среднем","относительно","сдвига","и","аддитивности","интеграла","Лебега","$(\\exists \\delta_1 > 0)$","$(\\forall h \\in (-\\delta; \\delta) \\setminus \\{ 0 \\})$","$\\int_{[-\\pi, \\pi]} \\lvert f(t + h) - f(t) \\rvert d\\mu(t)$","$\\leqslant$","$\\int_{\\mathbb{R}} \\lvert f(t + h) - f(t) \\rvert d\\mu(t)$","$<$","$\\frac{\\varepsilon}{4M}$",";","по","этой","же","лемме",",","т.к.","$g$","ограничена",",","ограничен","модуль","$g$",",","потому","$g \\in L_1[-\\pi, \\pi]$",",","$(\\exists \\delta_2 > 0)$","$(\\forall h \\in (-\\delta; \\delta) \\setminus \\{ 0 \\})$","$\\int_{[-\\pi, \\pi]} \\lvert g(t + h) - g(t) \\rvert d\\mu(t)$","$\\leqslant$","$\\int_{\\mathbb{R}} \\lvert g(t + h) - g(t) \\rvert d\\mu(t)$","$<$","$\\frac{\\varepsilon}{4B}$",".","Возьмём","$N$",",","чтобы","$\\frac{\\pi}{n}$","попадало","в","$\\delta_1$","и","$\\delta_2$","окрестности",":","$\\frac{\\pi}{n}$","$<$","$m$",",","если","$n > \\frac{\\pi}{m}$",".","$N$","$=$","$\\left\\lceil \\max \\left\\{ 1, \\frac{\\pi}{\\delta_1}, \\frac{\\pi}{\\delta_2} \\right\\} \\right\\rceil$",".","Обозначим","$\\frac{\\pi}{n}$","как","$h$",",","тогда","при","$n$","$>$","$N$","для","любого","$x$","из","$[-\\pi, \\pi]$","$w(h, x)$","$=$","$\\int_{-\\pi}^{\\pi} \\lvert \\chi(x, t + h) - \\chi(x, t) \\rvert d\\mu(t)$","$=$","$\\int_{-\\pi}^{\\pi} \\lvert f(x + t + h) g(t + h) + g(t + h) f(x + t) - g(t + h) f(x + t) - f(x + t) g(t) \\rvert d\\mu(t)$","$=$","$\\underbrace{\\int_{-\\pi}^{\\pi} \\lvert f(x + t + h) - f(x + t) \\rvert \\lvert g(t + h) \\rvert d\\mu(t)}_{(1)}$","$+$","$\\underbrace{\\int_{-\\pi}^{\\pi} \\lvert g(x + t) - g(t) \\rvert \\lvert f(x + t) \\rvert d\\mu(t)}_{(2)}$",".","Оценим","$(1)$",":","$(1)$","$\\leqslant$","$M$","$\\int_{-\\pi}^{\\pi} \\underbrace{\\lvert f(x + t + h) - f(x + t) \\rvert}_{u = x + t} d\\mu(t)$","$=$","$M$","$\\int_{-\\pi}^{\\pi} \\lvert f(u + h) - f(u) \\rvert d\\mu(t)$","$\\leqslant$","$M$","$\\frac{\\varepsilon}{4M}$","$=$","$\\frac{\\varepsilon}{4}$",",","пользуемся","тем",",","что","интеграл","периодической","функции","по","любому","периоду","один","и","тот","же",".","Оценим","$(2)$",":","$(2)$","$=$","$\\int_{-\\pi}^{\\pi} \\lvert g(x + t) - g(t) \\rvert \\lvert f_1(x + t) + f_2(x + t) \\rvert d\\mu(t) \\leqslant \\int_{-\\pi}^{\\pi} \\lvert g(x + t) - g(t) \\rvert \\lvert f_1(x + t) \\rvert d\\mu(t)$","$+$","$\\int_{-\\pi}^{\\pi} \\lvert g(x + t) - g(t) \\rvert \\lvert f_2(x + t) \\rvert d\\mu(t)$","$=$","$\\int_{-\\pi}^{\\pi} \\lvert g(x + t) - g(t) \\rvert B d\\mu(t)$","$+$","$\\int_{-\\pi}^{\\pi} (\\lvert g(x + t) \\rvert + \\lvert g(t) \\rvert) \\lvert f_2(x + t) \\rvert d\\mu(t)$","$<$","$B$","$\\frac{\\varepsilon}{4B}$","$+$","$\\int_{-\\pi}^{\\pi} (\\lvert g(x + t) \\rvert + \\lvert g(t) \\rvert) \\lvert f_2(x + t) \\rvert d\\mu(t)$","$<$","$\\frac{\\varepsilon}{2}$","$+$","$2M$","$\\frac{\\varepsilon}{4M}$","$=$","$\\frac{3}{4} \\varepsilon$",".","Значит",",","$(1)$","$+$","$(2)$","$<$","$\\varepsilon$",",","требуемое","выполнено","."]],

    [
        "Принцип локализации Римана-Лебега",
        [
            "Если",
            "$f \\in L_{2 \\pi}$",
            ",",
            "$(a, b)$ -- интервал",
            ", $(a, b) \\subset [-\\pi, \\pi]$, $(\\forall x \\in (a, b)) f(x) = 0$",
            ", $S_f(x)$ -- частичная сумма ряда Фурье функции $f$, тогда для любого $[a', b'] \\subset (a, b)$ $S_f(x)$ сходится",
            "равномерно к нулю на $[a', b']$"
        ]
    ],
    /*[
		"Доказательство",
		[]
	],*/

    // 3. Достаточные условия сходимости ряда Фурье в точке.

	["Признак Дини",["если","$f \\in L_{2 \\pi}$",",","$S \\in \\mathbb{R}$",",","$\\varphi_{x_0}(t)$","$=$","$\\frac{f(x_0 + t) + f(x_0 - t) - 2S}{t}$",",","$(\\exists \\delta > 0)$","$\\varphi_{x_0} \\in L_1(0, \\delta)$",",","тогда","тригонометрический","ряд","Фурье","функции","$f$","в","точке","$x_0$","сходится","к","$S$","(","как","числовой","ряд",")"]],

	["Гёльдерова функция",["пусть","$\\alpha \\in (0, 1]$",",","$S \\subset \\mathbb{R}$",",","$f: S \\to \\mathbb{R}$",",","$x_0 \\in S$",";","$f$","--","гёльдерова","порядка","$\\alpha$","в","точке","$x_0$",",","если","$\\exists \\lim_{x_0 + 0} f(x) = f(x_0 + 0)$","(","обозначим","$f(x_0 + 0)$",")",",","$\\exists \\lim_{x_0 - 0} f(x) = f(x_0 - 0)$","(","обозначим","$f(x_0 - 0)$",")","и","$(\\exists C, \\delta > 0)$","$(\\forall t \\in (0, \\delta)$","$\\lvert f(x_0 + t) - f(x_0 + 0) \\rvert $","$\\leqslant$","$C$","$t^\\alpha$","$\\land$","$\\lvert f(x_0 - t) - f(x_0 - 0) \\rvert$","$\\leqslant$","$C$","$t^\\alpha$"]],
	["Признак Липшица",["если","$f \\in L_{2 \\pi}$",",","$f$","--","гёльдерова","порядка","$\\alpha$","(", "любого", "порядка", ")","в","точке","$x_0$",",","то","тригонометрический","ряд","Фурье","функции","в","точке","$x_0$","сходится","к","$\\frac{1}{2}$","$\\left( \\lim_{x \\to x_0-0} f(x) + \\lim_{x \\to x_0+0} f(x) \\right)$"]],
	["Доказательство",["0",")","возьмём","$C$","и","$\\delta$","из","условия","гёльдеровости","$f$",":","&br&","$\\exists \\lim_{x_0 + 0} f(x) = f(x_0 + 0)$",",","$\\exists \\lim_{x_0 - 0} f(x) = f(x_0 - 0)$",",","$(\\exists C, \\delta > 0)$","$(\\forall t \\in (0, \\delta)$","$\\lvert f(x_0 + t) - f(x_0 + 0) \\rvert $","$\\leqslant$","$C$","$t^\\alpha$","$\\land$","$\\lvert f(x_0 - t) - f(x_0 - 0) \\rvert$","$\\leqslant$","$C$","$t^\\alpha$","&br&","1",")","сведем","к","признаку","Дини","для","того","же","$\\delta$",":","&br&","$\\varphi(t)$","$=$","$\\frac{f(x_0 + t) + f(x_0 - t) - 2S}{2}$",",","$S$","$=$","$\\frac{f(x_0 + 0) + f(x_0 - 0)}{2}$","$\\Rightarrow$","&br&","$\\varphi(t)$","$=$","$\\frac{(f(x_0 + t) - f(x_0 + 0)) + (f(x_0 - t) - f(x_0 - 0))}{2}$","&br&","1.1.",")","$\\varphi$","измерима","на","$(0, \\delta)$","&br&","1.2.",")","интеграл","$\\lvert \\varphi \\rvert$","по","$(0, \\delta)$","ограничен","из-за","гёльдеровости",":","&br&","$\\int_0^\\delta$","$\\lvert \\varphi(t) \\rvert$","$d\\mu(t)$","$=$","$\\int_0^\\delta$","$\\left\\lvert \\frac{(f(x_0 + t) - f(x_0 + 0)) + (f(x_0 - t) - f(x_0 - 0))}{2} \\right\\rvert$","$d\\mu(t)$","$=$","&br&","$\\frac{1}{2}$","$\\int_0^\\delta$","$\\lvert (f(x_0 + t) - f(x_0 + 0)) + (f(x_0 - t) - f(x_0 - 0)) \\rvert$","$d\\mu(t)$","$\\leqslant$","&br&","$\\frac{1}{2}$","$\\int_0^\\delta$","$\\lvert f(x_0 + t) - f(x_0 + 0) \\rvert$","$d\\mu(t)$","$+$","$\\frac{1}{2}$","$\\int_0^\\delta$","$\\lvert f(x_0 - t) - f(x_0 - 0) \\rvert$","$d\\mu(t)$","$\\leqslant$","&br&","$\\frac{1}{2}$","$\\int_0^\\delta$","$C$","$t^\\alpha$","$d\\mu(t)$","$+$","$\\frac{1}{2}$","$\\int_0^\\delta$","$C$","$t^\\alpha$","$d\\mu(t)$","$=$","&br&","$C \\left( \\left. \\frac{t^{\\alpha + 1}}{\\alpha + 1} \\right\\rvert_0^\\delta \\right)$","$=$","&br&","$C \\frac{\\delta^{\\alpha + 1}}{\\alpha + 1}$"]],

    // 4. Дифференцирование и интегрирование рядов Фурье. Порядок убывания коэффициентов Фурье.

    /*
    5. Теорема Жордана.
    6. Равномерная сходимость сумм Фейера для непрерывной функции.
    7. Теоремы Вейерштраееа о приближении непрерывных функций тригонометрическими и алгебраическими многочленами.
    */

    // 8. Минимальное свойство коэффициентов Фурье по ортогональной системе. Неравенство Бесселя.

    // 9. Полнота ортогональной системы функций. ортонормированный базис и равенство Пар- севаля.

    // 10. Полнота тригонометрической системы в пространстве функций, суммируемых с квадратом. Сходимость ряда Фурье в среднем квадратичном. Равенство Парсеваля для тригонометрической системы.

    /*
    11. Теорема Рисса-Фишера.
    12. Полнота и замкнутость ортогональной системы. их связь.
    13. Полнота пространств С[а,b] и L_p[а,b] при р > 1.
    */

    // 14. Непрерывность, интегрируемость и дифференцируемость собственных интегралов, зависящих от параметра.
    [
        "Теорема о непрерывности в точке интеграла, зависящего от параметра",
        [
            "Если",
            "$A \\subset \\mathbb{R}^n$",
            ",",
            "мера",
            "$E$",
            "конечна",
            ",",
            "$f: E \\times A \\to \\mathbb{R}$",
            ",",
            "$f_{1, \\alpha}(x) = f(x, \\alpha)$",
            "(",
            "для",
            "формальности",
            "можно",
            "завести",
            "функцию",
            "$f_1$",
            ",",
            "выдающую",
            "по",
            "альфе",
            "функцию",
            "$y(x) = f(x, \\alpha)$",
            ")",
            ",",
            "$f_{2, x}(\\alpha) = f(x, \\alpha)$",
            ",",
            "для",
            "любого",
            "$\\alpha \\in A$",
            "$f_{1, \\alpha}(x)$",
            "суммируема",
            "на",
            "$E$",
            ",",
            "$\\alpha_0 \\in A$",
            ",",
            "при",
            "почти",
            "всех",
            "$x$",
            "из",
            "$E$",
            "$f_{2, x}$",
            "непрерывна",
            "в",
            "$\\alpha_0$",
            ",",
            "$\\varphi$",
            "суммируема",
            "на",
            "$E$",
            ",",
            "при",
            "почти",
            "всех",
            "$x$",
            "из",
            "$E$",
            "для",
            "любого",
            "$\\alpha$",
            "из",
            "$A$",
            "$\\lvert f(x, \\alpha) \\rvert \\leqslant \\varphi(x)$",
            ",",
            "тогда",
            "$F(\\alpha) = \\int_E f(x, \\alpha) dx$",
            "(",
            "интеграл",
            ",",
            "зависящий",
            "от",
            "параметра",
            ")",
            "непрерывна",
            "в",
            "$\\alpha_0$"
        ]
    ],
    [
        "Доказательство",
        [
            "Рассмотрим",
            "произвольную",
            "последовательность",
            "Гейне",
            "${\\{\\alpha_n\\}}_{n = 1}^\\infty$",
            "такую",
            ",",
            "что",
            "$\\lim \\alpha_n = \\alpha_0$",
            ".",
            "Проверим",
            "условие",
            "теоремы",
            "Лебега",
            "о",
            "переходе",
            "к",
            "пределу",
            "для",
            "$f_n(x) = f(x, \\alpha_n)$",
            ":",
            "при",
            "почти",
            "всех",
            "$x$",
            "из",
            "$E$",
            "верно",
            "$\\lim f_n(x)$",
            "$=$",
            "$f(x, \\alpha_0)$",
            "(",
            "поточечный",
            "предел",
            "почти",
            "всюду",
            ")",
            ",",
            "почти",
            "всюду",
            "на",
            "$E$",
            "для",
            "любого",
            "$n$",
            "$\\lvert f_n(x) \\rvert$",
            "$=$",
            "$\\lvert f(x, \\alpha_n) \\rvert \\leqslant \\varphi(x)$",
            "измеримость",
            "есть",
            ",",
            "т",
            ".",
            "к",
            ".",
            "говорим",
            "про",
            "суммируемость",
            "$f$",
            "при",
            "каждом",
            "фиксированном",
            "$\\alpha$",
            ",",
            "мера",
            "конечна",
            ";",
            "Значит",
            ",",
            "$\\lim \\int_E f_n(x) d\\mu(x) = \\lim \\underbrace{\\int_E f(x, \\alpha_n) d\\mu(x)}_{F(\\alpha_n)} = \\int_E f(x, \\alpha_0) = F(\\alpha_0)$",
            ";",
            "поскольку",
            "последовательность",
            "Гейне",
            "была",
            "произвольной",
            ",",
            "можем",
            "заключить",
            ",",
            "что",
            "$\\lim_{\\alpha \\to \\alpha_0} F(\\alpha) = F(\\alpha_0)$"
        ]
    ],
    [
        "Следствие",
        [
            "если",
            "$f$",
            "непрерывна",
            "на",
            "$[a, b] \\times [c, d]$",
            ",",
            "то",
            "$F(\\alpha)$",
            "$=$",
            "$\\int_a^b f(x, \\alpha) dx$",
            "(",
            "непрерывна",
            ",",
            "потому",
            "существует",
            "даже",
            "интеграл",
            "Римана",
            ")",
            "непрерывна",
            "на",
            "$[c, d]$"
        ]
    ],

    /*
    15. Равномерная сходимость несобственных интегралов. зависящих от параметра. Критерий Коши. признаки Вейерштраееа и Дирихле.
    16. Непрерывность и интегрируемость несобственных интегралов, зависящих от параметра.
    17. Дифференцирование несобственных интегралов по параметру.
    */

    // 18. Гамма- и бета-функции и связь между ними.

    ["Гамма-функция",["гамма-функцией","называется","функция","$\\Gamma(\\alpha)$","$=$","$\\int_0^{+\\infty}$","$x^{\\alpha - 1}$","$e^{-x}$","$dx$",";","определена","при","$\\alpha$","$>$","$0$"]],
    
    ["Утверждение о сходимости гамма-функции",["несобственный","интеграл","в","определении","гамма-функции","сходится","(","гамма-функция","определена",")"]],
    ["Доказательство",["0",")","вспомним","интеграл","из","определения","гамма-функции",":","&br&","$\\int_0^{+\\infty}$","$x^{\\alpha - 1}$","$e^{-x}$","$dx$",",","$\\alpha > 0$","&br&","(","по","теории","несобственных","интегралов","Римана","две","особенности",",","разбиваем","на","два","интеграла",")","&br&","1",")","оценим","интеграл","от","$0$","до","$1$","по","признаку","сравнения",":","&br&","$(\\forall x \\geqslant 0)$","$e^{-x} \\leqslant 1$","$\\Rightarrow$","&br&","$(\\forall x \\geqslant 0)$","$x^{\\alpha - 1}$","$e^{-x}$","$\\leqslant$","$x^{\\alpha - 1}$",",","$\\int_0^1$","$x^{\\alpha - 1}$","$dx$","$=$","$\\left. \\frac{x^\\alpha}{\\alpha} \\right\\rvert_0^1 $","$<$","$+\\infty$","&br&","2",")","оценим","интеграл","от","$1$","до","$+\\infty$","(","тоже",")","по","признаку","сравнения",":","&br&","$(\\exists C > 0)$","$(\\forall x \\geqslant 1)$","$x^{\\alpha - 1} e^{-x} \\leqslant C e^{-\\frac{x}{2}}$",",","$\\int_1^{+\\infty}$","$e^{-\\frac{x}{2}}$","$dx$","$<$","$+\\infty$","(","этот","интеграл","даже","можно","посчитать",",","сделайте","один","раз",")"]],

    ["Утверждение о бесконечной дифференцируемости гамма-функции",["Гамма-функция","бесконечно","дифференцирема","в","любой","точке","области","определения","(","$\\alpha$","$>$","$0$",")"]],
	["Доказательство",["0",")","заменим","несобственный","интеграл","Римана","на","интеграл","Лебега",":","&br&","$\\Gamma(\\alpha)$","$=$","$\\int_0^{+\\infty}$","$f(x, \\alpha)$","$dx$","$=$","$\\int_0^{+\\infty}$","$f(x, \\alpha)$","$d\\mu(x)$","(","они","совпадают",",","доказывали","в","домашнем","задании","третьего","семестра",")","&br&","1",")","найдем","$n$-ую","производную","подынтегральной","по","$\\alpha$",":","&br&","$f(x, \\alpha)$","$=$","$x^{\\alpha - 1}$","$e^{-x}$","$\\Rightarrow$","&br&","$\\frac{\\partial^n f}{\\partial \\alpha^n}$","$=$","${\\mathopen{}\\left( x^{\\alpha - 1} e^{-x} \\right) \\mathclose{}}_{\\alpha}^{(n)}(x, \\alpha)$","$=$","${\\mathopen{}\\left( e^{(\\alpha - 1) \\ln(x)} e^{-x} \\right) \\mathclose{}}_{\\alpha}^{(n)}$","$=$","$\\ln(x)$","${\\mathopen{}\\left( e^{(\\alpha - 1) \\ln(x)} e^{-x} \\right) \\mathclose{}}_{\\alpha}^{(n - 1)}$","$=$","${(\\ln(x))}^n$","$x^{\\alpha - 1}$","$e^{-x}$","&br&","2.",")","оценим","$n$-ую","производную",":","&br&","2.1.",")","оценим","$\\ln(x)$","в","окрестности","нуля",":","&br&","$\\lim_{x \\to 0+}$","$x \\ln(x)$","$=$","$0$","$\\Rightarrow$","&br&","$(\\exists \\delta > 0)$","$(\\forall x \\in (0, \\delta))$","$\\lvert x \\ln(x) \\rvert$","$<$","$1$","$\\Rightarrow$","&br&","$(\\exists \\delta > 0)$","$(\\forall x \\in (0, \\delta))$","$\\lvert \\ln(x) \\rvert$","$<$","$\\frac{1}{x}$","(","можно","вычислить","этот","предел","с","помощью","правила","Лопиталя",",","сделайте","один","раз",")","&br&","2.2.",")","оценим","$\\ln(x)$","при","$x \\geqslant 1$",":","&br&","$(\\forall x > 1)$","$\\ln(x)$","$\\leqslant$","$x$","&br&","2.3",")","оценим","$n$-ую","производную","на","$(0, \\delta)$",":","&br&","$(\\exists C_1 > 0)$","$(\\forall x \\in (0, \\delta))$","$\\left\\lvert \\frac{\\partial^n f}{\\partial \\alpha^n}(x, \\alpha) \\right\\rvert$","$=$","${\\lvert \\ln(x) \\rvert}^n$","$x^{\\alpha - 1}$","$e^{-x}$","$\\leqslant$","&br&","$x^{\\alpha - n - 1} e^{-x}$","$\\leqslant$","&br&","$C_1$","$\\mathbb{I}(0 < x < \\delta)$","(","функция","$y(x)$","$=$","$x^{\\alpha - n - 1}$","$e^{-x}$","непрерывна","на","$[0, \\delta]$",",","потому","ограничена","по","теореме","Вейерштрасса",")","&br&","2.4.",")","оценим","$n$-ую","производную","на","$[\\delta, 1]$",":","&br&","$(\\exists C_2 > 0)$","$\\left\\lvert \\frac{\\partial^n f}{\\partial x^n}(x, \\alpha) \\right\\rvert$","$\\leqslant$","&br&","$C_2$","$\\mathbb{I}(\\delta \\leqslant x \\leqslant 1)$","(","функция","$y(x)$","$=$","$\\frac{\\partial^n f}{\\partial x^n}(x, \\alpha)$","непрерывна","на","$[\\delta, 1]$",",","потому","ограничена","по","теореме","Вейерштрасса",")","&br&","2.5.",")","оценим","$n$-ую","производную","на","$(1, +\\infty)$",":","&br&","$\\left\\lvert \\frac{\\partial^n f}{\\partial x^n}(x, \\alpha) \\right\\rvert$","$=$","${\\lvert \\ln(x) \\rvert}^n$","$x^{\\alpha - 1}$","$e^{-x}$","$\\leqslant$","&br&","$x^n$","$x^{\\alpha - 1}$","$e^{-x}$","$=$","$x^{n + \\alpha - 1}$","$e^{-x}$","&br&","2.6.",")","скомибинируем","оценки",":","&br&","$\\left\\lvert \\frac{\\partial^n f}{\\partial x^n}(x, \\alpha) \\right\\rvert$","$\\leqslant$","&br&","$C_1$","$\\mathbb{I}(0 < x < \\delta)$","$+$","$C_2$","$\\mathbb{I}(\\delta \\leqslant x \\leqslant 1)$","$+$","$x^{n + \\alpha - 1}$","$e^{-x}$","&br&","3.",")","функция","$f_{\\alpha, n}(x) = \\frac{\\partial^n f}{\\partial x^n}(x, \\alpha)$","ограничена","суммируемой","на","$(0, +\\infty)$",":","&br&","$\\int_0^{+\\infty} f_{2, \\alpha}(x)$","$d\\mu(x)$","=","$\\leqslant$","$C_1$","$\\delta$","$+$","$C_2$","$(1 - \\delta)$","$+$","$\\Gamma(n + \\alpha)$","(","по","монотонности","и","линейности","интеграла","Лебега",")","&br&","4.",")","функция","$f$","измерима",",","т.к.","непрерывна","&br&","5.",")","функция","$f_{\\alpha, n}(x)$","суммируема","по","предыдущему","пункту","&br&","6.",")","применяем","теорему","о","дифференцировании","интеграла","с","параметром","нужное","количество","раз",":","&br&","$F^{(n)}(\\alpha)$","дифференцируема",",","$F^{(n)}(\\alpha)$","$=$","$\\int_0^{+\\infty}$","$\\frac{\\partial^n f}{\\partial x^n}(x, \\alpha)$","$d\\mu(x)$"]],

	["Формула понижения для гамма-функции",["$(\\forall \\alpha > 0)$","$\\Gamma(\\alpha + 1)$","$=$","$\\alpha$","$\\Gamma(\\alpha)$","(","формула","понижения",")",",","$(\\forall n \\in \\mathbb{N} \\cup \\{ 0 \\})$","$\\Gamma(n + 1)$","$=$","$n!$"]],
	["Доказательство",["1",")","проинтегрируем","по","частям","интеграл","для","$\\Gamma(\\alpha + 1)$",":","&br&","$\\Gamma(\\alpha + 1)$","$=$","$\\int_0^{+\\infty}$","$x^{\\alpha}$","$e^{-x}$","$dx$","$=$","$\\int_0^{+\\infty}$","$x^{\\alpha}$","$d\\mathopen{}\\left(-e^{-x}\\right)\\mathclose{}$","$=$","$\\left. \\mathopen{}\\left(-e^{-x}\\right)\\mathclose{} x \\right\\rvert_0^{+\\infty}$","$+$","$\\int_0^{+\\infty}$","$e^{-x}$","$\\alpha$","$x^{\\alpha - 1}$","$dx$","$=$","$0$","-","$0$","$+$","$\\alpha$","$\\int_0^{+\\infty}$","$e^{-x}$","$x^{\\alpha - 1}$","$dx$","=","$\\alpha$","$\\Gamma(\\alpha)$","&br&","2",")","раскроем","$\\Gamma(n + 1)$",":","&br&","$\\Gamma(n + 1)$","$=$","$n$","$\\Gamma(n)$","$=$","$n \\cdot \\ldots \\cdot 1 \\cdot \\Gamma(1)$","&br&","3",")","$\\Gamma(1)$","$=$","$1$",":","&br&","$\\Gamma(1)$","$=$","$\\int_0^{+\\infty}$","$e^{-x}$","$dx$","$=$","$\\left. -e^{-x} \\right\\rvert_0^{+\\infty}$","$=$","$0$","$-$","$(-1)$","$=$","$1$"]],

	["Бета-функция",["Бета-функцией","называется","функция","$B(a, b)$","$=$","$\\int_0^1$","$x^{a - 1}$","${(1 - x)}^{b - 1}$","$dx$",";","определена","при","$a$","$>$","$0$","и","$b$","$>$","$0$"]],
	Связь бета- и гамма-функций
    
    /*
    19. Формула Гаусса-Эйлера для гамма-функции.
    20. Формула Валлиса. Представление синуса в виде бесконечного произведения.
    21. Формула дополнения для гамма-функции.
    22. Равносходимость интеграла и ряда Фурье в точке.
    */

    //23. Преобразование Фурье. Обратное преобразование Фурье. Свойства преобразования Фурье суммируемой функции. Формулы обращения.
    [
        "Интеграл от комплекснозначной функции",
        "Пусть $E \\subseteq \\mathbb{R}$, $f: E \\to \\mathbb{R}$,",
        "$g_1(x) = \\Re(f(x))$, $g_2(x) = \\Im(f(x))$ измеримы на $E$;",
        "интегралом функции $f$ по множеству $E$ $\\int_E f(x) d\\mu(x)$ называется комплексное число",
        "$\\int_E Re(f(x)) d\\mu(x) + i \\int_E Im(f(x)) d\\mu(x)$; интерируема по $E$, если $g_1$ и $g_2$ интегрируемы по $E$"
    ],

    [
        "Преобразование Фурье",
        [
            "Пусть $f \\in L_1(\\mathbb{R}); преобразованием Фурье функции $f$ называется функция",
            "$\\hat{f}(\\lambda) = \\frac{1}{\\sqrt{2 \\pi}} \\int_{\\mathbb{R}} f(t) e^{- i \\lambda t} d\\mu(t)$;",
            "обозначется $F[f]$"
        ]
    ],
    [
        "Обратное преобразование Фурье",
        [
            "Пусть $F \\in C(\\mathbb{R}); обратным преобразованием Фурье функции $F$ называется функция",
            "$\\tilde{F}(x) = \\frac{1}{\\sqrt{2 \\pi}} \\text{v.p.} \\int_{\\mathbb{R}} e^{i \\lambda t} F(\\lambda) d\\lambda$",
            "(интерируем непрерывные, потому это даже интеграл Римана);",
            "обозначется $F^{-1}[F]$"
        ]
    ],

    // Называть "Формула обращения преобразования Фурье"
    [
        "Следствие из теоремы Дини для интеграла Фурье",
        [
            "Если $f \\in L_1(\\mathbb{R}), $f$ удовлетворяет условию Гёльдера (любого порядка),",
            "тогда $\\tilde{\\hat{f}}(x) = f(x)$ ($F^{-1}[F[f]](x) = f(x)$)"
        ]
    ],

    [
        "Линейность преобразования Фурье для функций из $L_1(\\mathbb{R})$",
        [
            "Если",
            "$f, g \\in L_1(\\mathbb{R})$",
            ",",
            "$\\alpha, \\beta \\in \\mathbb{R}$",
            ",",
            "тогда",
            "$(\\forall x \\in \\mathbb{R})$",
            "$F[\\alpha f + \\beta g](\\lambda)$",
            "$=$",
            "$\\alpha F[f](\\lambda)$",
            "+",
            "$\\beta F[g](\\lambda)$"
        ]
    ],

    [
        "Непрерывность и бесконечная малость преобразования Фурье функции из $L_1(\\mathbb{R})$",
        [
            "Если $f \\in L_1(\\mathbb{R})$, тогда $\\hat{f}$ непрерывна на $\\mathbb{R}$ и $\\lim_{\\lambda \\to \\infty} \\hat{f}(\\lambda) = 0$"
        ]
    ],
    [
        "Свойство для растяжения и сжатия преобразования Фурье функции из $L_1(\\mathbb{R})$",
        [
            "Если $f \\in L_1(\\mathbb{R})$, $\\alpha > 0$, $\\varphi(x) = f(\\alpha x)$, тогда",
            "$\\hat{\\varphi}(\\lambda)$",
            "$=$",
            "$\\frac{1}{\\alpha} \\hat{f}\\mathopen{}\\left( \\frac{\\lambda}{\\alpha} \\right)\\mathclose{}$"
        ]
    ],
    [
        "Доказательство",
        [
            "По",
            "определению",
            "преобразования",
            "Фурье",
            "и",
            "интеграла",
            "комплекснозначной",
            "функции",
            "$\\hat{\\varphi}(\\lambda)$",
            "$=$",
            "$\\frac{1}{\\sqrt{2 \\pi}}$",
            "$\\int_{-\\infty}^{\\infty} \\varphi(t) e^{-i \\lambda t} d\\mu(t)$",
            "$=$",
            "$\\frac{1}{\\sqrt{2 \\pi}}$",
            "$\\int_{-\\infty}^{\\infty} \\varphi(t) \\cos(\\lambda t) d\\mu(t)$",
            "$-$",
            "$i$",
            "$\\frac{1}{\\sqrt{2 \\pi}}$",
            "$\\int_{-\\infty}^{\\infty} \\varphi(t) \\sin(\\lambda t) d\\mu(t)$",
            ";",
            "сделав",
            "замену",
            "$t = \\frac{u}{\\alpha}$",
            ",",
            "получим",
            "$\\hat{\\varphi}(\\lambda)$",
            "$=$",
            "$\\frac{1}{\\sqrt{2 \\pi}}$",
            "$\\frac{1}{\\alpha}$",
            "$\\int_{-\\infty}^{\\infty} f(u) \\cos\\mathopen{}\\left( \\frac{\\lambda}{\\alpha} u \\right)\\mathclose{} d\\mu(u)$",
            "$-$",
            "$i$",
            "$\\frac{1}{\\sqrt{2 \\pi}}$",
            "$\\frac{1}{\\alpha}$",
            "$\\int_{-\\infty}^{\\infty} f(u) \\sin\\mathopen{}\\left( \\frac{\\lambda}{\\alpha} u \\right)\\mathclose{} d\\mu(u)$",
            "$=$",
            "$\\frac{1}{\\alpha}$",
            "$\\frac{1}{\\sqrt{2 \\pi}}$",
            "$\\int_{-\\infty}^{\\infty} f(u) e^{-i \\frac{\\lambda}{\\alpha} u} d\\mu(u)$",
            "$=$",
            "$\\frac{1}{\\alpha} \\hat{f}\\mathopen{}\\left( \\frac{\\lambda}{\\alpha} \\right)\\mathclose{}$"
        ]
    ],

    [
        "Свойство для сдвига преобразования Фурье функции из $L_1(\\mathbb{R})$",
        [
            "Если $f \\in L_1(\\mathbb{R})$, $a \\in \\mathbb{R}$, $\\psi(x) = f(x + a)$, тогда",
            "$\\hat{\\psi}(\\lambda)$",
            "$=$",
            "$e^{i a \\lambda} \\hat{f}(\\lambda)$"
        ]
    ],
    [
        "Доказательство",
        [
            "По",
            "определению",
            "преобразования",
            "Фурье",
            "и",
            "интеграла",
            "комплекснозначной",
            "функции",
            "$\\hat{\\psi}(\\lambda)$",
            "$=$",
            "$\\frac{1}{\\sqrt{2 \\pi}}$",
            "$\\int_{-\\infty}^{\\infty} \\psi(t) e^{-i \\lambda t} d\\mu(t)$",
            "$=$",
            "$\\frac{1}{\\sqrt{2 \\pi}}$",
            "$\\int_{-\\infty}^{\\infty} f(t + a) \\cos(\\lambda t) d\\mu(t)$",
            "$-$",
            "$i$",
            "$\\frac{1}{\\sqrt{2 \\pi}}$",
            "$\\int_{-\\infty}^{\\infty} f(t + a) \\sin(\\lambda t) d\\mu(t)$",
            ";",
            "сделав",
            "замену",
            "$t = u - a$",
            ",",
            "получим",
            "$\\hat{\\psi}(\\lambda)$",
            "$=$",
            "$\\frac{1}{\\sqrt{2 \\pi}}$",
            "$\\int_{-\\infty}^{\\infty} f(u) \\cos( \\lambda (u - a) ) d\\mu(u)$",
            "$-$",
            "$i$",
            "$\\frac{1}{\\sqrt{2 \\pi}}$",
            "$\\int_{-\\infty}^{\\infty} f(u) \\sin\\left( \\lambda (u - a) \\right)\\mathclose{} d\\mu(u)$",
            "$=$",
            "$\\frac{1}{\\sqrt{2 \\pi}}$",
            "$\\int_{-\\infty}^{\\infty} f(u) e^{-i \\lambda (u - a)} d\\mu(u)$",
            "$=$",
            "$e^{i \\lambda a} \\hat{f}\\mathopen{}\\left( \\lambda \\right)\\mathclose{}$",
            "(линейность",
            "интеграла",
            "комплекснозначной",
            "не",
            "доказывали",
            "на",
            "лекции",
            ",",
            "но",
            "я",
            "доказал",
            "отдельно)"
        ]
    ],

    // 24. Преобразование Фурье производной и производная преобразования Фурье. Свертка и ее преобразование Фурье.

    // 24. Преобразование Фурье производной и производная преобразования Фурье. Свертка и ее преобразование Фурье.
    [
        "Теорема о преобразовании Фурье производной",
        [
            "Если",
            "$f, f' \\in L_1(\\mathbb{R})$",
            ",",
            "$f$",
            "абсолютно",
            "непрерывна",
            "на",
            "любом",
            "отрезке",
            ",",
            "тогда",
            "$(\\forall \\lambda \\in \\mathbb{R})$",
            "$F[f'](\\lambda)$",
            "$=$",
            "$(-i \\lambda) \\hat{f}(\\lambda)$"
        ]
    ],
    // Следствие из теоремы о преобразовании Фурье производной
    [
        "Теорема о производной преобразования Фурье",
        [
            "Если",
            "$f(t), tf(t) \\in L_1(\\mathbb{R})$",
            ",",
            "тогда",
            "преобразование",
            "Фурье",
            "$\\hat{f}(\\lambda)$",
            "дифференцируемо",
            ",",
            "$\\forall \\lambda \\in \\mathbb{R}$",
            "${\\mathopen{}\\left(\\hat{f}\\right)\\mathclose{}}'(\\lambda)$",
            "$=$",
            "$F[-it f(t)]$"
        ]
    ],

    /*
    25. Пространства основных и обобщенных функций. Дифференцирование обобщенных функций. Дельта-функция.
    26. Пространство Шварца быстро убывающих функций.
	*/

    [
        "Пространство $L_n([a, b])$",
        [
            "пусть",
            "$[a, b]$",
            "--",
            "отрезок",
            "$\\mathbb{R}$",
            ";",
            "пространством",
            "$L_n([a, b])$",
            "называется",
            "факторпространство",
            "пространства",
            "измеримых",
            "на",
            "$[a, b]$",
            "(",
            "это",
            "лин.",
            "пространство",
            "с",
            "поточечными",
            "сложением",
            "и",
            "умножением",
            "на",
            "константу",
            ")",
            "по",
            "отношению",
            "эквивалентности",
            "совпадать",
            "почти",
            "всюду",
            "(получилось тоже линейное пространство)"
        ]
    ],
    // TODO: проверить ближе к сессии, что получилось действительно линейное пространство.

    [
        "Склалярное произведение на $L_n([a, b])$",
        [
            "пусть",
            "$[a, b]$",
            "--",
            "отрезок",
            "$\\mathbb{R}$",
            "$n \\in \\mathbb{N}",
            "(с единицы)",
            ";",
            "скалярным",
            "произведением",
            "функций",
            "из",
            "$L_n$",
            "будем",
            "называть ${\\langle f, g \\rangle}_{L_n}..."
        ]
    ],

    [
        "Ортогональная система в $L_2$",
        [
            "пусть",
            "${\\{ e_k \\}}_{k = 1}^\\infty$",
            "--",
            "набор",
            "классов",
            "функций",
            "из",
            "$L_2([a, b])$",
            ";",
            "${\\{ e_k \\}}_{k = 1}^\\infty$",
            "называется",
            "ортогональной",
            "системой",
            "в",
            "$L_2([a, b])$",
            ",",
            "если",
            "$(\\forall i, j \\in \\mathbb{N})$",
            "${\\langle e_i, e_j \\rangle}_{L_2} = 0$",
            "(",
            "скалярное",
            "произведение",
            "любых",
            "двух",
            "классов",
            "равно",
            "нулю",
            ")"
        ]
    ],

    // Определение коэффициентов Фурье по ортогональной системе.

    [
        "Носитель функции",
        [
            "пусть",
            "$E \\subset \\mathbb{R}$",
            "$f: E \\to \\mathbb{R}$",
            ";",
            "носителем",
            "функции",
            "$f$",
            "называется",
            "$\\operatorname{supp} f$",
            "$=$",
            "$\\operatorname{cl}(\\{ x \\in E: f(x) \\neq 0 \\})$",
            "(",
            "замыкание",
            "множества",
            "точек",
            ",",
            "где",
            "функция",
            "не",
            "ноль",
            ")"
        ]
    ],

    // Определение финитной функции (с ограниченным носителем)

    // Лемма о том, что множество непрерывных финитных функций всюду
    //   плотно в L_1(\\mathbb{R}) (тогда надо не только для отрезка
    //   L_n определять, а для подмножества)

    // Определение нормы функций.

    // Лемма о том, что каждая суммируемая на R функция непрерывна в
    //   среднем относительно сдвига, т.е. lim int ...

    // Лекция 2.
    // Теорема Римана об осцилляции (Лемма Римана-Лебега).

    [
        "Следствие теоремы Римана об осцилляции (леммы Римана-Лебега)",
        [
            "если",
            "$f \\in L_1([a, a + 2 \\pi])$",
            ",",
            "$\\mathopen{}\\left(a_0, {\\{ a_n \\}}_{n = 1}^\\infty, {\\{ b_n \\}}_{n = 1}^\\infty\\right)\\mathclose{}$",
            "--",
            "коэффициенты",
            "Фурье",
            "для",
            "$f$",
            ",",
            "тогда",
            "$\\lim_{n \\to \\infty} a_n = 0$",
            "и",
            "$\\lim_{n \\to \\infty} b_n = 0$"
        ]
    ],

    // Здесь много пропущено. Пересмотреть, добавить.
    // Многочлены Чебышева.
    // Обобщённый синус-ряд Фурье.
    // Пример разложения в обощённый синус-ряд Фурье.
    /* Используется при вычислении синуса в компьютере, наверно. */

    // Классические ортогональные многочлены и связанные примеры ортогональных систем
    // Многочлены Якоби. Многочлены Гегенбауэера (ультрасферические)
    //   (связаны с так называемыми сферическими гармониками, они важны
    //   для людей, которые исследуют упаковывание в коробки)
    // Многочлены Лежандра.
    // Многочлены Чебышева первого рода и второго рода.
    // Многочлены Лагерра
    // Многочлены Эрмита (Чебышева-Эрмита).
    /* Такие системы возникают в уравнениях математической физики, и не только, например, в комбинаторной геометрии. */

    // Нужно ли писать "тригонометрический?"
    [
        "Ядро Дирихле",
        [
            "пусть",
            "$n \\in \\mathbb{N}$",
            "(с единицы)",
            ";",
            "ядром",
            "Дирихле",
            "называется",
            "функция",
            "$D_n(u)$",
            "$=$",
            "$\\frac{1}{2} + \\sum_{k = 1}^n \\cos(ku)$",
            "$=$",
            "$\\frac{\\sin\\mathopen{}\\left(n \\mathopen{}\\left(n + \\frac{1}{2}\\right)\\mathclose{}\\right)\\mathclose{}}{2 \\sin\\mathopen{}\\left(\\frac{n}{2}\\right)\\mathclose{}}$"
        ]
    ],
    // Пространство L_{2 \\pi}
    [
        "Лемма о представлении частичной суммы тригонометрического ряда Фурье",
        [
            "если",
            "$f \\in L_{2 \\pi}$",
            "$(a_0, {\\{ a_n \\}}_{n = 1}^\\infty, {\\{ b_n \\}}_{n = 1}^\\infty)$",
            "--",
            "ряд",
            "Фурье",
            "для",
            "$f$",
            ",",
            "$S_n(f, x)$",
            "$=$",
            "$\\frac{a_0}{2} + \\sum_{k = 1}^n (a_k \\cos(kn) + b_k \\sin(kn))$",
            "($n$-ая частичная сумма тригонометрического ряда Фурье)",
            ",",
            "тогда",
            "$S_n(f, x)$",
            "$=$",
            "$\\frac{1}{\\pi} \\int_{-\\pi}^\\pi f(t) D_n(x - t) d\\mu(t)$",
            "$=$",
            "$\\frac{1}{\\pi} \\int_{-\\pi}^\\pi f(x + u) D_n(u) d\\mu(u)$"
        ]
    ],

    [
        "Признак Дини",
        [
            "если",
            "$f \\in L_{2 \\pi}$",
            ",",
            "$\\delta > 0$",
            ",",
            "$S_{x_0} \\in \\mathbb{R}$",
            "$\\varphi_{x_0}(t) = \\frac{f(x + t) + f(x - t) - 2S_{x_0}}{t} \\in L_1((0, \\delta))$",
            "тогда тригонометрический ряд Фурье сходится к $S_{x_0}$" // TODO: может, его как-то обозначить? Чтобы словами долго не писать.
        ]
    ],

    // Лекция 3.
    [
        "Условие Гёльдера",
        [
            "пусть",
            "$f: X \\to \\mathbb{R}$",
            ",",
            "$X \\subset \\mathbb{R}$",
            ",",
            "$x_0 \\in X$",
            ";",
            "$f$",
            "удовлетворяет",
            "условию",
            "Гёльдера",
            "порядка",
            "$\\alpha$",
            "в",
            "точке",
            "$x_0$",
            ",",
            "если",
            "существуют",
            "пределы",
            "$\\lim_{t \\to +0} f(x_0 + t)$",
            "и",
            "$\\lim_{t \\to -0} f(x_0 + t)$",
            "(односторонние пределы в точке)",
            "и",
            "$(\\exists C > 0, \\delta > 0)$",
            "$(\\forall t: 0 < t < \\delta)$",
            "$\\mathopen{}\\left|f(x+t) - \\lim_{t \\to +0} f(x+t)\\right|\\mathclose{} \\leqslant C t^\\alpha$",
            "$\\land$",
            "$\\mathopen{}\\left|f(x+t) - \\lim_{t \\to -0} f(x+t)\\right|\\mathclose{} \\leqslant C t^\\alpha$"
        ]
    ]
];
