// Code style: предложения и словосочетания в скобочках являются целым словом, они не должны быть длинными, от двух до пяти слов.
//   В запятые не входят пробелы. В интерфейсе и так пространство есть.
//   В определениях для предположений используется "пусть", а в утверждениях "если",
//   поскольку "если", как мне кажется, меньше нагружает текст, чем пусть, но при этом оно
//   не подходит для определений.
analysis_3sem = [
	// Определение интеграла Лебега для ограниченных функций
	// Определение интеграла Лебега для неотрицательных функций
	// Определение интеграла Лебега для произвольных функций
	/*[
		"Основная теорема об интеграле Лебега от ограниченных функций",
		["если", "мера", "$E$", "конечна", ",", "$\\{f_n\\}_{n = 1}^\\infty$", "измеримы",
			"на", "$E$", ",", "$\\lim\\limits_{n \\to \\infty} f_n(x) = f(x)$",
			"почти", "всюду", "на", "E", "(поточечный предел почти всюду)", ",",
			"$|f_m(x)| \\leqslant F(x)$", "для", "любого", "$m \\in \\mathbb{N}$",
			"почти", "всюду", "на", "$E$", ",", "$F$", "суммируема", "на", "$E$", ",",
			"тогда", "$f$", "суммируема", "на", "$E$", "и",
			"$\\int\\limits_E f(x) d\\mu(x) = \\lim\\limits_{m \\to \\infty} \\int\\limits_E f_m(x) d\\mu(x)$"
		]
	],
	[
		"Основная теорема об интеграле Лебега от неотрицательных функций",
		["если", "мера", "$E$", "конечна", ",", "$\\{f_n\\}_{n = 1}^\\infty$", "измеримы",
			"на", "$E$", ",", "$\\lim\\limits_{n \\to \\infty} f_n(x) = f(x)$",
			"почти", "всюду", "на", "E", "(поточечный предел почти всюду)", ",",
			"$|f_m(x)| \\leqslant F(x)$", "для", "любого", "$m \\in \\mathbb{N}$",
			"почти", "всюду", "на", "$E$", ",", "$F$", "суммируема", "на", "$E$", ",",
			"тогда", "$f$", "суммируема", "на", "$E$", "и",
			"$\\int\\limits_E f(x) d\\mu(x) = \\lim\\limits_{m \\to \\infty} \\int\\limits_E f_m(x) d\\mu(x)$"
		]
	],*/
	[
		"Теорема Лебега о переходе к пределу в интеграле Лебега",
		["если", "мера", "$E$", "конечна", ",", "$\\{f_n\\}_{n = 1}^\\infty$", "измеримы",
			"на", "$E$", ",", "$\\lim\\limits_{n \\to \\infty} f_n(x) = f(x)$",
			"почти", "всюду", "на", "E", "(поточечный предел почти всюду)", ",",
			"$|f_m(x)| \\leqslant F(x)$", "для", "любого", "$m \\in \\mathbb{N}$",
			"почти", "всюду", "на", "$E$", ",", "$F$", "суммируема", "на", "$E$", ",",
			"тогда", "$f$", "суммируема", "на", "$E$", "и",
			"$\\int\\limits_E f(x) d\\mu(x) = \\lim\\limits_{m \\to \\infty} \\int\\limits_E f_m(x) d\\mu(x)$"
		]
	],
	[
		"Теорема Леви о монотонной сходимости",
		["если", "мера", "$E$", "конечна", ",", "$\\{f_n\\}_{n = 1}^\\infty$", "измеримы", "и", "неотрицательны",
			"на", "$E$", ",", "$\\{f_m(x)\\}_{m = 1}^\\infty$", "неубывающая", "почти", "всюду", "на",
			"$E$", ",", "тогда",
			"$\\int\\limits_E \\lim\\limits_{m \\to \\infty} f_m(x) d\\mu(x) = \\lim\\limits_{m \\to \\infty} \\int\\limits_E f_m(x) d\\mu(x)$"
		]
	],
	
]