let prob_and_meas_theory_3sem = [
	// TODO: попробовать
	[
		"Определение вероятностного пространства",
		["Вероятностное", "пространство", "--", "это", "тройка", "$(\\Omega, F, P)$", ":",
			"$\\Omega$"
		]
	],

	// Лекция 6.
	[
		"Определение полукольца",
		["Если", "$S$", "--", "полукольцо", ",", "$A, A_1, \\ldots, A_k \\in S$", ",",
			"$\\bigsqcup\\limits_{i = 1}^k A_i \\subseteq A$", ",", "то",
			"$\\exists A_{k + 1}, \\ldots, A_n \\in S: A = \\bigsqcup\\limits_{i = 1}^n A_i$"
		]
	],
	[
		"Определение кольца",
		["Если", "$S$", "--", "полукольцо", ",", "$A, A_1, \\ldots, A_k \\in S$", ",",
			"$\\bigsqcup\\limits_{i = 1}^k A_i \\subseteq A$", ",", "то",
			"$\\exists A_{k + 1}, \\ldots, A_n \\in S: A = \\bigsqcup\\limits_{i = 1}^n A_i$"
		]
	],

	// Лекция 7.
	[
		"Лемма о ... (не знаю пока, как назвать)",
		["Если", "$S$", "--", "полукольцо", ",", "$A, A_1, \\ldots, A_k \\in S$", ",",
			"$\\bigsqcup\\limits_{i = 1}^k A_i \\subseteq A$", ",", "то",
			"$\\exists A_{k + 1}, \\ldots, A_n \\in S: A = \\bigsqcup\\limits_{i = 1}^n A_i$"
		]
	],

	// Можно ещё формальнее, наверно, записать определение в { ... } -- через аксиому
	//   выделения. Чтобы они её отражали.
	[
		"Теорема о структуре минимального кольца",
		["Пусть", "$S$", "--", "полукольцо", ",", "$R(S)$", "--", "минимальное", "кольцо",
			",", "тогда",
			"$R(S) = K(S) = \\left\\{ \\bigsqcup_{i = 1}^n A_i : A_1, \\ldots, A_n \\in S, A_i \\cup A_j = \\varnothing \\right\\}$",
			";", "по-другому", "$K(S)$", "--", "это", "всевозможные", "конечные", "дизъюнктные", "объединения",
			"элементов", "кольца", "$S$"
		]
	],


];